{"status":"ok","feed":{"url":"https://theintegrativepractitioner.substack.com/feed","title":"Somatics Science Spirit","link":"https://theintegrativepractitioner.substack.com/","author":"Shannon Myers, MS, SEP","description":"Deep reflections and somatic-spiritual practices on how to embody wholeness in a fragmented world.","image":"https://substackcdn.com/image/fetch/$s_!BM2m!,w_256,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F76a76c51-74e6-43e5-8606-129d09f80224_500x500.png"},"items":[{"title":"The Thirst for Wholeness: Why Alcoholism and Addiction may be a \"Broken Initiations\"","pubDate":"2026-01-27 17:05:25","link":"https://theintegrativepractitioner.substack.com/p/the-thirst-for-wholeness-why-alcoholism","guid":"https://theintegrativepractitioner.substack.com/p/the-thirst-for-wholeness-why-alcoholism","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"Addiction as a Spiritual Malady, Jung &amp; The \"Gift of Madness\"and why Trauma Healing is the prerequisite for Intuition","content":"\n<p><strong>What if addiction isn’t a pathology, but a “psychospiritual malady”; a misguided attempt to touch the Divine?</strong></p>\n<p>We often view addiction - whether to substances, work, or perfectionism; as a disease of the will. But what if it is actually a misdirected spiritual event? A <strong>“Broken Initiation”</strong> where the seeker attempted to fly into the heights but lacked the <strong>Eldership</strong> to return safely?</p>\n<p>We live in a culture drowning in information but starving for Wisdom. We have access to infinite data and “optimization,” but we lack the <strong>Initiated Elders</strong> who can hold the container when our reality expands beyond our nervous system’s capacity.</p>\n<p>I sat down with <strong>Brian Maierhofer</strong> (Therapist, Writer, Actor, and fellow seeker) to map the invisible architecture of addiction, the necessity of initiation, and the somatic reality of spiritual awakening.</p>\n<p><strong>We connected over a shared truth:</strong> Traditional structures are failing us. Standard therapy often stays trapped in the cognitive mind. Executive coaching often ignores the wounded inner child. Both systems tend to bypass the ancestral, spiritual, and relational bodies that actually hold the keys to our wholeness.</p>\n<p>In this conversation, we deconstruct the <strong>Myth of Icarus</strong>. We argue that his fall wasn’t a failure of hubris; it was a failure of <strong>Culture</strong>. It wasn’t that he flew too close to the sun; it was that the Elder (Daedalus) hadn’t built a container strong enough to catch him.</p>\n<h3><strong>In this episode, we explore:</strong></h3>\n<ul>\n<li><p><strong>The Psychospiritual Malady:</strong> Viewing addiction not as a flaw, but through the Jungian lens of <strong>ancestral trauma</strong> and the “thirst for wholeness.”</p></li>\n<li><p><strong>Tuning the Instrument:</strong> Why you cannot develop clear Intuition or Psychic abilities until you heal your <strong>Trauma</strong>. (If your nervous system is stuck in survival, your signal is distorted).</p></li>\n<li><p><strong>The Physics of Co-Regulation:</strong> The resonance field of the nervous system and how to maintain energetic boundaries as a practitioner and human.</p></li>\n<li><p><strong>The Healing Vortex:</strong> Why true integration requires a return to play, making “bad art,” and expanding your somatic capacity to hold joy.</p></li>\n</ul>\n<p><strong>Watch the full conversation.</strong></p>\n<div><hr></div>\n<h3><strong>About the Guest:</strong></h3>\n<p><strong>Brian Maierhofer</strong> is a Therapist, Actor, and Writer. His upcoming book, <em>The Gift of Madness</em>, will explore how cultural dysfunction is being pathologized in individuals.</p>\n<ul><li><p><strong>Follow Brian:</strong> https://substack.com/@brianmaierhofer</p></li></ul>\n<div><hr></div>\n<h3><strong>Work with Shannon in 2026</strong></h3>\n<p>I have upgraded my practice infrastructure to better serve the collective. And have opened a limited number of new client spots for deep somatic healing, transpersonal healing, energy medicine + mediumship, mentorship, and strategic advisory.</p>\n<p><strong>Apply Here: </strong>https://theintegrativepractitioner.com/</p>\n<div><hr></div>\n<p><em>The authenticity in me honors the authenticity arising in you.</em></p>\n<p><strong>-Shannon </strong></p>\n","enclosure":{"link":"https://api.substack.com/feed/podcast/185539313/812a46da98c185aafadac95dc6d91b0b.mp3","type":"audio/mpeg"},"categories":[]},{"title":"Decoding the Nonsense: Why the Medical Model and the Wellness Industry are Both Failing You","pubDate":"2026-01-20 12:17:24","link":"https://theintegrativepractitioner.substack.com/p/beyond-the-profit-of-pain-reclaiming","guid":"https://theintegrativepractitioner.substack.com/p/beyond-the-profit-of-pain-reclaiming","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"A 25-year investigation into the medical-industrial complex and the \"spiritual cosplay\" of the wellness world; and the somatic strategy for living your values out loud.","content":"\n<p><strong>The Internal Compass: Why Living Your Values is a Radical Act of Rebellion</strong></p>\n<p>To live our values out loud is dharmic and a source of inner regulation. We can either silence our true north star and suffer or we can dream a world into being in which all are safe, belong, and their have human rights honored. </p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics Science Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n<p>As a complex Trauma survivor, I needed to start working very early. Many times folks are shocked when I tell them how I started working in dangerous situations for money paid under the table very, very early. Also due to childhood trauma, I had to take on a lot of responsibility early - more than most adults. Raising myself, my siblings, and my parents. Another piece to the puzzle as to why I am here teaching, is that I am neurodivergent and notice patterns.</p>\n<p>Being neurodivent and surviving horrific conditions has lead me to being a rapid pattern detector of dysfunction. (I wrote more on that <a href=\"https://theintegrativepractitioner.substack.com/p/trauma-survivors-and-neurodivergent\">here.</a>) In adulthood, I have sourced the wisdom from my trauma and it has lead me to being a systems change maker in my adulthood. With my systems thinking brain, I have been fortunate to help disrupt and change multiple systems. Of course with others aligned in the same values I embody. </p>\n<p>This piece is a deep-dive on the 25-year investigation into systemic trauma and nonsense in the medical fields and wellness worlds. It is vulnerable, raw, and messy writing. And parts of me did not even want to publish it. Yet, I am choosing to embody courage today as courage always trumps complicity. Plus it will make my soul sing to cut through the noise of the status quo to bring you field notes of what is actually going on vs. citing off boring research.</p>\n<p>Below is somewhat of an expose as I share real-life stories and examples of my 25+ year career attempting to fix the systems that harm. Some of the time it worked, other times I cried a lot and burnt out. Overall, I have no regrets as you can never go wrong living your values out loud. Our values being the closet thing to embodying the wisdom of our soul.</p>\n<p>Of course, there was much disappointment in this quarter-of-a-century experiment as I noticed systemic patterns of collective dysfunction in nearly every system I encountered in the west. And because my values align with creating a world in which all are safe to exist and to make this world a better place: I have high hopes for humanity. I have seen a lot of changes and I have played a role in creating some of those changes.</p>\n<p>So while I list out some of the absolute nonsense happening in the west - know that it comes from a place of hope. And from the acknowledgement that in every single sector and field, there are true bodhisottva’s working to fix broken systems. The more I awaken to our True Nature, the more I notice more truly enlightened beings working behind the scenes. In every sector, there are good humans serving heart-centered to enact change for all they serve. </p>\n<p>It also needs to be stated that I recognize systemic patterns faster than most. This can upset folks who are not yet aware of systemic dysfunction. Later, many sheepishly will tell me that I was right and saw it early. Yet seeing something early should be something that is valued and not resisted. Because a dysfunctional pattern is a negative feedback loop. No matter if you notice it on day one or decades later. I just happen to be someone who notices it on day one and I do believe neurodivergent trauma survivors should not be discounted and instead cherished for the ways in which we notice.</p>\n<p> There is a deep gift of noticing. And due to being what the world calls “neurodivergent” yet, I refer to being fully authentic, awaken, and soulful. However, not everyone’s soul hurts when they see others suffering like mine does apparently, so they don’t wake up with a fire in their belly to create changes in the world like I do. Yet I believe if folks were to truly heal into wholeness, they too would wake up and want to help resolve the suffering of humanity. So to me there is wounding with conformity with the status quo that creates suffering in the first place.</p>\n<p>So if that is what “neurodivergent” means: I will proudly wear the label. Neurodivergent people and Trauma Survivors are like canaries in the coal mines - we warn society about patterns that can cause harm first after we are harmed due to our expanded nervous system and soul sensitivity. We should be listened to. Seeing things early could advert so much collective harm and suffering. </p>\n<p><strong>The Profit of Pain: Lessons from the Inside of the Pharmaceutical Sickness Machine</strong></p>\n<p>We need to talk about the elephant in the room. The USA healthcare system is broken. What is happening in the USA in terms of healthcare (and so much more) can’t truly be understood in other developed countries. Most other developed countries have universal healthcare and therefore cannot fathom the insanity that is the incentive structures of a for-profit healthcare system. In my 25+ year professional career, I have tried to change the system from the inside out in a variety of roles.</p>\n<p>Many don’t know this but I was once a pharmaceutical sales representative. I was newly out of college with a very expensive business degree and my grandfather, one of the two safe adults in my life, had recently passed away from complications of diabetes. So I wanted to learn all I could about diabetes and became a diabetes pharmaceutical sales representative. I also had crushing student debt and it was either that or selling one of my organs.</p>\n<p>If you have ever seen any TV shows about the pharmaceutical sales industry - they aren’t lying. It is gross and sad. There of course are good people in every industry so I don’t like making blanket statements. For me, this job was super rough and I learned a lot from the inside out. </p>\n<p>Towards the end of my two-year stint as a “drug rep” carrying insulin samples and Cialis pills around - I found out the secrets to our healthcare system. P.S. This was way before social media and the internet being popular so cut me some slack on how long it took to connect the dots.</p>\n<p>How did I uncover incentive nonsense? A doctor who was close to retiring was unhinged on a Friday afternoon. He didn’t have any patients and had some time on his hands. As he was weeks away from retiring, he finally felt like he could speak freely. So he called me into his office to show me how he made money off of writing prescriptions. </p>\n<p>In his explanation, he essentially was told by the healthcare system he worked for that he needed to write a certain number of prescriptions. And from those prescriptions he made a bonus and received a kick-back. These weren’t small bonuses either - in the tens of thousands of dollars. Some of the kickbacks were made to him personally and most of them were made to his healthcare system - the clinic/hospital. None of this of course was his idea.</p>\n<p>He then went on to me to tell me that certain diagnoses were more profitable then others. So his office was told by the healthcare system that he worked for to take certain patients with certain health conditions and not take others. COPD he told me was not profitable so he could not take new patients who had it. </p>\n<p>So if someone called in a healthcare crisis who had COPD, he literally could not take care of them. If another potential patient wanted a better sex life and was looking for erectile dysfunction pills (which have a high margin of profit), he could take this new patient. And as someone who swore to not do harm as part of his Hippocratic Oath - you can imagine the ethical dilemma he was in and how much of a moral injury it was for him - as he truly loved people.</p>\n<p>He also explained that when someone was very sick then they weren’t as profitable - so the answer was really to keep patients somewhat sick and to serve only patients who had profitable health conditions that could be prescribed certain pharmaceuticals.</p>\n<p>I chatted with him for a couple hours that Friday afternoon. He spoke with tears in his eyes and rage in his voice. He did not become a Doctor to be a drug pusher he told me - he became a doctor to help people. And you know what? Many of the doctors who I came to know across my short drug rep career - said the same thing. So did the nurses and staff. I left his office that Friday and shortly afterwards. </p>\n<p><strong>Why the \"Sickness Model\" is Working Exactly as Designed</strong></p>\n<p>Later, after another stint in a role serving patients on the business side of things as a medical device sales representative who sold medical devices - I learned a lot about the insurance industry. It was in learning about medicaid reimbursement, medicare, and private insurance and the harms happening there - that I in part, went back to graduate school to become a counselor. I too wanted to help. And again, even in that field I was met with the sad reality that is healing in the America. </p>\n<p>While I never diagnosed a soul or pathologized anyone as I was a non-traditional and non-clinical rehabilitation counselor (not a mental health therapist)…I had my heart broken in that field as well. While trying to help, I often felt helpless. There it was where I learned just how large the American system that kept people sick and suffering was. I learned it was designed to keep some people barely surviving and other people thriving. </p>\n<p>It was in being a rehabilitate counselor that I would cycle between hope and hopelessness over and over again. Systemic barriers faced many who I served and it took super-human amounts of collaboration with human services colleagues across multiple organizations in order to sometimes pull off getting something funded for one mutual client of ours. We would work tirelessly in learning the various funding streams and ways in which we could hack the systems that harm. </p>\n<p>All of us would hear horrific stories of human rights violation and suffering and many times we would have our hands tied behind our back. When something was funded by say a grant - we faced so much red tape and systemic barriers to prove that we deserved the funding. </p>\n<p>Sadly, all the red tape meant a lot of times we spent the majority of the day writing reports to the system or systems funding the grant and not being able to truly help those suffering. It truly was maddening. And yet, we did pull off some amazing systemic changes. </p>\n<p>It was in being a rehabilitation counselor that my faith was restored that there were so many other heart-aligned humans who truly wanted to reduce the suffering on the planet. Many of my beloved colleagues across various human services fields, therapy, and state and federal agencies that gave me hope. </p>\n<p>Most of them were the most over-credentialed and underpaid professionals in America. They could have made four to five times more money per year in the business world and they chose to serve and be frustrated each and every day because they cared. </p>\n<p>Yet we were set up to fail by a faulty system. By design. The system works to keep many people suffering and under-resourced. I truly believe many of the systems in America work for how they were designed. To keep some folks in positions of power and other folks dis-empowered.</p>\n<p>In yet another Dark Night of the Soul, I started to get sick as my body was in constant stress so I chose myself and started to work for myself as an integrative healing practitioner, mentor, and consultant. The system change consulting work I did at my own business also was slow, painful, and grueling. Sick systems don’t change overnight and just like human nervous systems they get stuck in their own dysfunctional trauma loops. </p>\n<p>So I continued to work with non-profits, the state and federal government, harm reduction education, and working at universities - just as a collaborator on the outside and not directly inside the system. For me, this felt better as I was less directly impacted by the chronic stress of having to work and be in a system constantly under tension. </p>\n<p>Of course some good change happened and still there was frustration. Up until the past couple of years I saw real change start to ripple out. Today, many of those systems are being de-funded and critical lifesaving funds are no longer. </p>\n<p>It honestly has broken my heart to have worked for so long and to have hoped for change and to see things still so broken. Yet I remain hopeful, as there are millions of good folks who believe in humanity and we creatively and collaboratively will figure it out. This I know for sure. We are who we have been waiting for.</p>\n<p><strong>The Wellness Illusion: When “Wellness” Becomes Another Performance</strong></p>\n<p>While I had high hopes for the wellness world when I became self-employed 15 years ago and hoped to make changes from the inside out - I also found a similar dysfunction there too. Just wearing a different hat. </p>\n<p>Of course we sometimes think the grass will be greener on the other side, right? And the reality is that humans living in a dysfunctional society are going to do dysfunctional things no matter where they are.</p>\n<p>And I really do believe the root cause of all of this is the overall dysfunction that is the western world that views the body and mind as something to dominate and medicate. The soul as something to outsource to a gate-keeping. </p>\n<p>The implicit belief in an unwell culture is that healing needs to be performed and your ego needs to be inflated in order to belong. All of it of course, coming from un-examined conditioning and un-processed inter-generational trauma. Yet again, this is something that I likely see too early and maybe decades from now, society will come along.</p>\n<p>While there are so many problems that exist in the traditional healthcare system - there are also a number of issues in alternative healing. I wanted to point out the wellness nonsense as so many are disenfranchised with the modern medical system. As well as, traditional healthcare seems to shut out anything holistic and of course people go seeking solutions. </p>\n<p>And I get it. I once was completely disabled with 14 physical and mental health diagnoses and carried around a bag of medications. At one point, I was near death and could not walk and talk or speak. It was then that I had a metaphysical death and near death experience in which I learned my calling in life.</p>\n<p>I am here doing that calling. Teaching and educating the masses. Values are to be lived and action taken for change to happen in our world. And I believe in a Trauma-Informed world in which the traditional medical model can be integrated with alternative and holistic health. </p>\n<p>Once our society moves from rugged individualism and performing healing - we can hopefully realize we are interconnected and value individual and collective healing. As that is how our well ancestors healed from their physical and soul wounds.</p>\n<p>So to be fair, I am going to point out some of the wellness noise going on. So that if in your seeking for wholeness you jump outside the medical model - that less harm happens. Below are just a couple examples of really poor Trauma work and neurodiversity nonsense being done under the guise of “healing” in the wellness world.</p>\n<p><strong>Let’s Start with Social Media</strong></p>\n<p>The algorithms work in such a way that they want you stay scrolling. They want people to stay in the comments and reply back and forth. Hopefully, emotionally so you stay on the platform. This is why engagement rates are tracked. </p>\n<p>So we have well meaning practitioners teaching about trauma and then inviting their followers to share in the comments. Folks are sharing intimate details of their trauma history. There is no support or co-regulation beyond maybe the original poster writing a couple of sentences in a reply, or some emojis. </p>\n<p>Yet those commenting have a nervous system that is time-traveling somatically and psychologically back to trauma-time. They may be reactivated. Of course the algorithm loves this because in their fight, flight, freeze, or dissociation - they stay on the platform and or buy things. <em><strong>This sadly is happening because trauma work and neurodiversity support is so inaccessible in America. So I get it. And I also want trauma survivors and neurodiverse folks to truly be supported.</strong></em></p>\n<p>What’s the solution? Actual community and safer spaces. Now this too is getting weird as folks are taking trauma survivors and neurodivergent humans off social media and onto WhatsApp, Telegram, and their own communities. While some good work is happening. Some cult-like stuff is occurring as well. Discernment is key. </p>\n<p><strong>From Screams to Biohacking: Decoding the Nonsense of Superficial Somatics</strong></p>\n<p>Okay, just for educational purposes: Often a trapped scream is often a trapped Fight response that needs to come out slowly, with titration, and pendulation in order to come into integration for healing to happen. When folks scream into the woods their fight parts may come out and may stay out. Anger may be unleashed without any containment or strategies to come down into integration. </p>\n<p>The person may leave the retreat and hours or days later be very dysregulated, dissociated, and re-activated. <em><strong>Again, I get it. Facilitators want to help folks and nature is healing. But when we open up to trauma physiology without proper containment, it can get messy real quick. So if these types of retreats “don’t work for me” - it’s not you, Boo. It’s the lack of true trauma-informed support.</strong></em></p>\n<p>What’s the solution? Realizing that healing trauma is likely not going to happen in a weekend. What can happen though is connection with other humans who have also been through hard things. I really do wish these retreat facilitators would promote connection over trauma healing. Because connection is the piece of the work that is possible. What you can do is individually focus on connecting with others while you are there.</p>\n<p><strong>Masterminds Where Executives Over-Share About Their Trauma</strong></p>\n<p>The intention of many masterminds are right and again it is the container and support that is off. When folks do a lot of sharing in mastermind containers, there often is a lot of stress and trauma physiology present in the room. Being a business owner is by nature very stressful. And entrepreneurs are 500% more likely to have ADHD. </p>\n<p>In my decades of working with folks with ADHD, I have never met one person with ADHD or thought they might have ADHD that wasn’t also traumatized because they did or may have ADHD. So let’s consider that most folks in a mastermind may have a trauma history. </p>\n<p>Usually the share circle in a mastermind turns into over-sharing. Trauma neural pathways are opened and reactivated. Often folks connect and begin to trauma bond. Any way you shake it, there usually isn’t a trauma expert present that is doing deep and long-term trauma resolution work with the mastermind attendees. </p>\n<p>There is often no time for the deep integration that needs to happen either. So these executives manager parts then come in to save the day and after the retreat make them overwork and hang on like hell to their success. While the rest of their lives may continue to be a mess.<em><strong> Again, no shade. I am reporting what is happening in our shared reality. Like I said, the intentions are good. The execution and containers may need to be updated.</strong></em></p>\n<p>What is the solution? What may be the best fit is to bring in a trauma expert to be with folks before, during, and afterwards for long-term integration and support.  Another solution is for facilitators to get training in Trauma to be more Trauma-Informed. You don’t need to do anything about Trauma for attendees except recognize it and slow down to ground. Finally, participants can plan on scheduling afterwards with their Trauma practitioner, shaman, or supportive Trauma-Informed witness.</p>\n<p><strong>The Biohacking Trap: Why Wearables Can’t Replace Somatic Wisdom</strong></p>\n<p>Many in the wellness fields have lost the plot and for over a decade now I have witnessed influencers dominate their bodies online and then sell supplements, blood panels, trackers, you name it. I haven’t even shown a picture here and yet we both have an image in our mind of this archetype. As a trauma practitioner who is also trained in root causes of the physical nature, this has been brutal to witness. </p>\n<p>Yes, so many biohacking things can work. But if you have unprocessed Trauma then you may as well dump your supplements down the drain. (I am not saying to literally do this - talk with your wellness practitioner.) </p>\n<p>But we need to recognize that so many folks come to the biohacking movement from a place of chronic stress and unacknowledged trauma. The stories I could tell! When your trauma is processed, you are not usually using a lot of wearables unless biohacking is coming from a place of curiosity or your special interests. Instead, you can hear the signals in your body when Trauma is resolved. No Fitbit needed.</p>\n<p>Trying to dominate the body in itself is a Trauma Response. Because when Trauma is healed: we are the body. Wholeness means the mind, body, and spirit are interconnected. So please, if you have spent a lot of money on supplements, panels, wearables, and biohacking; you may want to get curious about somatics, your limiting beliefs, and unprocessed chronic stress/Trauma.<em><strong> </strong></em></p>\n<p>Folks are desperate in America about their chronic dysregulation, lack of preventive care, and root-causes not being addressed due to a broken healthcare system and an emotionally immature and spiritually bankrupt society. So again, I get it. <em><strong>And what I am saying is that most biohackers absolutely are not trauma-informed. </strong></em>P.S. taking one online class doesn’t make someone trauma-informed. And there is a difference between being trauma-informed and being someone who can help you resolve trauma. </p>\n<p>What’s the solution? Expanding out of all or nothing thinking. You can hack your health and also acknowledge your trauma. You can supplement and practice somatics. You can seek alternative solutions and also seek out trauma healing. Luckily, these days trauma healing can either be traditional or alternative. So align with your culture and values and do you, Boo.</p>\n<p><strong>And Don’t Get Me Started on Psychedelic Healing in the West</strong></p>\n<p>Holy hell. Holy f*cking hell. Of course very good things are happening. However, this is rare. I could write 75 more articles on this topic alone and still it wouldn’t scratch the absolute nonsense and lack of true trauma and shamanic training necessary. </p>\n<p>Right now, we have therapists getting a certificate after one medicine ceremony and an online training. This training is lacking in what a soul may actually need. Plant medicines are conscious and you must truly earn the right to serve medicine. </p>\n<p>Our indigenous ancestors get this more than the healthcare system yet they have been villianized for their ancestral training. What we can know is that you likely have not earned the rights to usher soul fragments of someone’s altered state of consciousness in a therapeutic setting from an online certificate.</p>\n<p>Then there is the underground. And everything, everywhere, all at once is going on there. Of course there are very good things and wisdom tradition space holders that have been initiated and worked underground for decades and generations. </p>\n<p>There are also un-integrated neo-shamans who have done a couple plant medicine ceremonies and are possessed with the Wounded Healer or Shaman archetype and don’t know it. The archetype isn’t integrated nor it their trauma. So all of that will be unconsciously projected onto your healing. Yikes, is that messy.</p>\n<p>We also must acknowledge where many of these psychedelic medicines come from - animistic cultures that are collective and interconnected with the Spirit World. When a westerner enters that container, they have a western psyche. Not an animistic spirit that from birth understands the spirit world and the physical world are different sides to the Coin of Life. So many seeking psychedelic healing may end up with what I call “Ontological Shock” afterwards. The psyche/soul expanded too much, too fast, and too soon. </p>\n<p>Preparation usually doesn’t happen in a trauma-informed way that the western mind needs. And then usually long-term psychedelic integration is bypassed entirely. At best, integration is misunderstood. Overall, these are done in a weekend or maybe a bit longer and then the person flies home and goes back to their job and life as if nothing happened. Talk about dissociation and parts not even landing! Much less integration happening. </p>\n<p>I could go on and on but I won’t keep you. <em><strong>This is happening because humanity is in a spiritual crisis and is seeking spiritual solutions. I get it. </strong></em>I am taking issue with how it is being done and most of my consulting and teaching work has been around trauma-trained harm reduction for the USA, indigenous communities, and practitioners. Each situation of course is unique and overall, it is not going well. I remain hopeful and in service to creating more Trauma-Informed Care across the world.</p>\n<p>What is the solution? For the facilitator it is doing your inner work and truly having enough of your own psychedelic egoless dis-identifying experiences so you stay humble. As well as getting non-traditional training such as eldership and shamanism. Along with of course, getting trauma-trained in multiple modalities. </p>\n<p>Also, having at least one if not more difficult experiences yourself and working to integrate that over the course of a decade. Because you can’t truly integrate what you haven’t experienced. This is soul work and tropes used in traditional therapeutic training are not going to be enough for those with really difficult experiences, trauma histories, or having “ontological shock.” </p>\n<p>For seekers, please use discernment. If something feels off, trust it. Understand that seeking a peak experience is often a Trauma-Response (I wrote about that <a href=\"https://substack.com/home/post/p-157950448\">here.</a>) Urgency and rushing? Also Trauma-Responses. Get trauma support from someone who understand psychedelic integration and is also trauma-informed. This of course is the great paradox. Many wisdom traditions are not trauma-informed and many who are trauma-informed don’t understand shamanism, animism, and expanded states of consciousness. This bridge is slowly being built.</p>\n<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/%24s_!2tLz!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\">\n<picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!2tLz!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!2tLz!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!2tLz!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!2tLz!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/%24s_!2tLz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png\" width=\"1024\" height=\"608\" data-attrs='{\"src\":\"https://substack-post-media.s3.amazonaws.com/public/images/fa9ada40-9126-40bb-b369-53b56648b310_1024x608.png\",\"srcNoWatermark\":null,\"fullscreen\":null,\"imageSize\":\"normal\",\"height\":608,\"width\":1024,\"resizeWidth\":null,\"bytes\":null,\"alt\":null,\"title\":null,\"type\":null,\"href\":null,\"belowTheFold\":true,\"topImage\":false,\"internalRedirect\":null,\"isProcessing\":false,\"align\":null,\"offset\":false}' class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!2tLz!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!2tLz!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!2tLz!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!2tLz!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ffa9ada40-9126-40bb-b369-53b56648b310_1024x608.png 1456w\" sizes=\"100vw\" loading=\"lazy\"></source></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\">\n<button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" width=\"20\" height=\"20\" viewbox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title>\n<path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewbox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button>\n</div></div>\n</div></a><figcaption class=\"image-caption\">Heart-Centered Legacy Starts With Inner Courage</figcaption></figure></div>\n<p><strong>Systemic Humility: Building the Integrative Bridge Between Science and Spirit</strong></p>\n<p>TL;DR: In Summary the Traditional Healthcare is Broken and So is the Wellness World<strong>. </strong>And guess what? We are here to either improve these systems or create new ones. Humans are great at one thing: fixing problems. </p>\n<p>However, it is problematic to point out problems and not come at it with some solutions. Even if the solutions are half-formed or misinformed to start out. So come at these issues with your half-formed solutions. </p>\n<p>It is entirely ethical and moral to point out issues and provide solutions in your field or in areas you are seeking care. So many healthcare practitioners have been so traumatized by their fields that they fawn and appease and when someone calls out the systemic harm - they will defend the very system that is harming them too and those they are caring for. So I get why people often have a hard time with my direct approach to laying out issues and solutions.</p>\n<p><strong>Being The Change We Seek</strong></p>\n<p>Each of us at our core are not dis-empowered like these raggedy systems want us to think. We are empowered co-creators and we have thousands of small and big choices each day that we can make. Each of us can start to make changes in our lives and in the systems we are a part of by getting educated. </p>\n<p>We can also open up our minds, get curious, and listen to the lived experiences of others. This can help us get outside of our own biases. Truly what heals one person has harmed another. So please understand that with about nine billion humans on the planet, it is going to take some time to come into collective Trauma-Informed Care. </p>\n<p>The bridge from the east to the west is being built. Traditional and shamanic cultures are starting to talk to one another. So is the medical model and wellness worlds. It also is on every practitioner to really learn and humble themselves in what they think they know. Cultural competence starts with cultural humility. Trauma-Informed Care starts with education.</p>\n<p>What I see as the major area to be improved is the fact that traditional healthcare world and human services fields have too much red tape, aren’t trauma-informed enough, and have not integrated holistic health. And then on the other hand the wellness world often does not have enough checks and balances, isn’t trauma-informed, and every health condition is just one biohack away from healing. </p>\n<p>Overall, what all systems can do to get more with the times of where humanity is truly at is getting Trauma-Informed. You simply cannot have enough trauma-training. So take a trauma class once a year. Listen and read stories of lived experience. And stay curious. </p>\n<p>How I resolved the disconnect of filling the gaps that folks fall through in the medical side of things and the nonsense that is happening on the other side in the wellness world - was to become an integrative practitioner. I embrace it all. And I remain critical of the gaps that people fall into so that I may do something to fix the systems in which we all are part, whether we like it or not. </p>\n<p>My personal and professional solutions to our systemic dysfunction are: providing education, creating integrative service-offerings, writing to empower, and I have created an entire trauma-trained integrative modality. Because I not only professional investigated these fields over the last 25 years, I also was a complex trauma survivor who was neurodivergent and was harmed by the same systems. Since I have a choice to either complain or take action. I chose action. And I did what I could to create systemic solutions. </p>\n<p>Pointing out issues within our respective fields is not a bad thing. It is natural to point out problems when you see harm happening. Awake humans do sit in silence witnessing other humans suffer. It goes against humanity and the soul. </p>\n<p>Unfortunately, to question the status quo may come with negative consequences in an emotionally and spiritually immature society. I cannot say that I haven’t gotten harassed and misunderstood by pointing out issues and offering solutions. </p>\n<p>So it may take a heavy dose of courage to stand up to systems that harm. Yet at the end of this day, this is soul work. To change systems that harm to make a more peaceful earth is what Bodhisattva’s do. It was what change-makers do. It is how awakened humans live and serve.</p>\n<p>And it is what living your values out loud may mean. To fully be integrated and whole it means we take good care of ourselves and good care of our community. Making changes to systems that harm can create a lasting legacy that will be here long after our short time on Earth. </p>\n<p>It does need to be pointed out that the most change I have seen in all of my career has been working one on one with individual clients and small groups. This is where I can use my knowledge of all of the ways I have trained and my knowledge of systems harm to help clients and groups resolve chronic stress, trauma, and live their values out loud too. And the last 15 years I have come to accept that all of the systemic nonsense is the result of the lack of a Trauma-Informed Society.<em><strong> And that is definitely something I can do something about.</strong></em></p>\n<p>So I aim to provide soul solutions for the very issues I have noticed. Generations from now my future family members who I have not met in the flesh and rather guide over in spirit, will benefit from my time here today. As will members of my shared human extended family. </p>\n<p>That is worth being temporarily misunderstood by some people who have not had the same personal or professional experience as I have had. I can live with that. And my soul can dance across the cosmos knowing that my small self actually dared to do something with my precious time on this beautiful planet.</p>\n<p><strong>Heart-Centered Courageous Service Comes from The Authentic Self</strong></p>\n<p>Our practice this week is around courage. True courage comes from the Authentic Self - -which we can encounter in our soma/soul. Contrary to what you may have been conditioned to believe, courage does not come from fight parts that seek revenge on systems that harm. This is false courage and it comes from dirty pain that is unconsciously seeking to dominate or control the “other” in which it opposes.</p>\n<p>True Courage comes from our clean core of our True Nature of the Self and it is patient, wise, and embodied. The True Self is heart-centered and comes at problems from a place of wisdom and full embodiment of the soul that does not seek quick superficial solutions. It seeks systemic and permanent change that ripples out. Including the courage to truly be our Authentic Self. As authenticity gives others permission to be themselves.</p>\n<p>Unfortunately, courage coming from a place of wisdom and regulation often is not taught. Many advocates are coming from a place of unprocessed Trauma due to systems Trauma they have incurred. And I get it, as that was how I was taught to enact change. Yet as I healed, I saw another path. (To learn more about how trauma often showing up an advocates please read <em>“No Bad Parts: Healing Trauma &amp; Restoring Wholeness”</em> by Dr. Richard C. Schwartz <a href=\"https://www.penguin.co.uk/books/461388/no-bad-parts-by-schwartz-richard/9781785045110\">here.</a>)</p>\n<p>True change and heart-centered advocacy comes from a place of courage that is somatically heart-centered, regulated, and embodied. Trying to change someone or a system that does not want to be change, can be a boundary violation of another being. So to truly change systems, we must change ourselves first and in that change we will model the new world that we are co-creating with millions of other awakened souls.</p>\n<p>Simply, to be courageous is to be whole. It is action without force. It is dharmic without dogma. And it is regulated. Know that it takes courage to bring goodness into a world that is often dysfunctional. And courage comes a place of increased somatic capacity. Which is why we will practice courage this week for our somatic practice.</p>\n<p><strong>The Practice: A Somatic Calibration for Increased Heart-Centered Courage</strong></p>\n<ul>\n<li><p>Come into noticing the room around you, 360 degrees, with softer eyes.</p></li>\n<li><p>Breathe and blink.</p></li>\n<li><p>Notice your feet/seat/body being support by the earth below you. Put one or both hands on your heart.</p></li>\n</ul>\n<ul>\n<li><p>Think/feel/visualize the changes you are bringing to earth each day to make this planet more safe, beautiful, and a place where all belong. This can something as simple as being more present, creating art, or being kind. If you are working on a systems change project: think/feel/visualize its completion and who will benefit. </p></li>\n<li><p>When you think/feel/visualize the changes you are making in your life or systems you are changing - next think/feel/visualize it all working out in the end. You were more present, you created more art, you were more kind. If you visualized systems change - imagine the change rippling out generations from now. In either case, this is legacy work. Feel into your body how it expands a little bit when you think/feel/visualize being more heart-centered and courageous a little bit more each day.</p></li>\n<li><p>Yes, protective parts may show up and say negative things or make the body contract - that is natural. The good news is that both the Authentic Self and traumatized/conditioned parts can be present at the same time. You can kindly say back to that thought or part of your body contracting “thank you for keep me safe, I am practicing noticing what it feels like to feel/visualize a bit more courage leading to future change.” Then once again notice what it feels like to notice that what you are doing today can impact the future even if it is just 0.1% change.</p></li>\n<li><p>Notice the shift from this short somatic practice. Notice the quality of your thinking, the sensation in your body, and the rhythm of your breath. Notice how things are a bit different for you since the start of this practice.</p></li>\n<li><p>As you practice this week - notice yourself shifting. And if you want to, let us know how it is going in the comments.</p></li>\n<li><p>If this practice felt difficult or “weird,” that is natural; especially for high-achievers used to “dominating” their body or advocates who have been conditioned that change has to be dysregulating. As always, somatic Trauma support can be transformative. </p></li>\n<li>\n<p><strong>Know: You cannot get this practice wrong.</strong> Simply choosing courage over forcing change starts to re-calibrate your internal GPS and reminds your nervous system that you are becoming a little bit more whole.</p>\n<p></p>\n<p></p>\n<p>To move toward being more fully human, follow my writings, somatic practices, and love notes to humanity right here.</p>\n<p></p>\n<p><em><strong>The authenticity in me honors the authenticity arising in you,</strong></em></p>\n<p>-Shannon</p>\n</li>\n</ul>\n<div><hr></div>\n<blockquote>\n<p><strong>Dig Deeper:</strong><br>If you are looking for more teachings like these, explore my series on authenticity, wholeness, and somatic-spiritual practices in my previous articles and videos.</p>\n<p><strong>Work With Me:</strong><br>Applications to work with me can be found at my website <a href=\"https://theintegrativepractitioner.com/\">here.</a> I am currently refreshing my 2026 offerings and have limited space in the coming week for:</p>\n</blockquote>\n<ul>\n<li><p><strong>Two new online healing clients</strong> (Root-cause recovery for Trauma, Complex Trauma, Neurodivergent Burnout, and Chronic Stress)</p></li>\n<li><p><strong>Two new mentoring clients</strong> (Deepening heart-aligned authenticity and somatic capacity for seekers and healing practitioners)</p></li>\n<li><p><strong>One new advisory client</strong> (Nervous system-informed strategy for visionary changemakers, entrepreneurs, and leaders)</p></li>\n<li><p>To schedule a podcast or Substack Live with me, just reach out. I love educating and collaborating!</p></li>\n</ul>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics Science Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!2tLz!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/fa9ada40-9126-40bb-b369-53b56648b310_1024x608.png","type":"image/jpeg"},"categories":[]},{"title":"Decoding Stress from Trauma: Why Self-Improvement Fails and How to Notice Real Healing Happening","pubDate":"2026-01-13 12:17:22","link":"https://theintegrativepractitioner.substack.com/p/decoding-stress-from-trauma-why-self","guid":"https://theintegrativepractitioner.substack.com/p/decoding-stress-from-trauma-why-self","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"Beyond the wellness noise: Why confusing stress with trauma stalls your recovery, and the somatic metrics for recalibrating your internal GPS toward wholeness.","content":"\n<p><strong>The Misinformation Trap: Why Confusing Stress with Trauma Stalls Your Growth</strong></p>\n<p>Social media is the Capital City of Trauma and Healing Misinformation. A lot of what is being “sold” as “Trauma Healing” on these platforms really only apply to Stress Responses. And Stress Responses are natural. Stress is part of life. </p>\n<p>Of course stress can suck. Big time. But stress is not the same as Trauma. Stress without a Trauma history - stops after the threat. Stress is time limited.</p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics Science Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n<p><br>Trauma on the other hand, continues to show up in your mind and body until as experiences of uncompleted self-protection responses. These uncompleted responses are the Trauma patterns that are continuing to show up as less-than-helpful patterns now. Trauma Responses keep going on and on until the uncompleted self-protection responses are completed. This is called “Trauma Integration.”</p>\n<p>And we don’t want to villanize or pathologize Trauma Responses because: they kept you alive at one point. Yet Trauma Responses are ongoing. <em>Trauma Responses can be stressful but they are entirely different than stress or stress responses.</em></p>\n<p>The place where stress can cross over is with chronic stress. Our bodies are not meant to be in chronic stress. Unfortunately in a dysregulated society, chronic stress has gotten normalized. But chronic stress is entirely abnormal. Look to nature and the weather. A storm always passes. The sun comes out after the rain. This is natural. To chronically be in storm - is unnatural.</p>\n<p>Our bodies can and do code chronic stress as trauma - coupling aspects of life as “dangerous” when chronic stress goes on too long. So that is the piece I will agree wellness influencers when it comes to Trauma. When stress is chronic it can impair (traumatize) the nervous system. And I still want to point out that many influences conflate trauma with stress. <em>Stress and Trauma are NOT the same thing.</em></p>\n<p>One really important thing I want to point out is with terminology of chronic stress vs. Trauma. Over the past couple of decades working with humans and teaching millions online - I have of noticed some trends. And one of those trends is that many folks will accept the term “chronic stress.”</p>\n<p>However, many people will deny, minimize, or pathologize Trauma. Including healthcare practitioners. Want to know the biggest thing that holds folks back from healing? Most traumatized people will deny that trauma is the cause of their health and life difficulties. Or worse, their healthcare practitioner won’t understand Trauma.</p>\n<p>Yes, I said it. Millions upon millions will never heal from Trauma because of the word “Trauma.” They will deny their Trauma or their healthcare practitioner will - and they will suffer. So I am not going to dance around words or nuance here. Your quality of life may depend on knowing the difference between stress and Trauma. </p>\n<p></p>\n      <p>\n          <a href=\"https://theintegrativepractitioner.substack.com/p/decoding-stress-from-trauma-why-self\">\n              Read more\n          </a>\n      </p>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!-3lS!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/387370b4-1d68-4408-bee8-7a67da8aba55_1024x608.png","type":"image/jpeg"},"categories":[]},{"title":"Organic Intelligence: Reclaiming the Rhythms of Your Nervous System","pubDate":"2026-01-06 11:10:27","link":"https://theintegrativepractitioner.substack.com/p/the-science-of-sustainable-wholeness","guid":"https://theintegrativepractitioner.substack.com/p/the-science-of-sustainable-wholeness","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"Beyond the expansion myth: Why self-improvement fails without somatic integration, and the Oak Tree Protocol for returning to your Authentic Nature.","content":"\n<p><strong>Biological Rhythms: Nature’s 3-Phase Blueprint for Wholeness</strong></p>\n<p>One of the most common patterns of wholeness in nature is the process of coming into expansion, then contraction, and then integration. Nature does this over and over again, in cycles and rhythms. Many influencers and supposed “Trauma Experts” hyper-focus only on expansion. And while authenticity requires levels of expansion - it also requires the full integration cycle to happen. The full cycle includes expansion, contraction, AND integration. </p>\n<p>And to complete a full healing cycle (integration) we need to have education, support, the conditions for the full cycle to occur, and inner somatic resources. In this article I will provide education and information for these conditions to occur. </p>\n<p>We can also look to nature as our guide and teacher. The trees that grow in the Midwest region in America are great symbols of outer nature reflecting the potential of our inner nature.</p>\n<p>Imagine an oak tree. It begins to bloom in the first season of the year: spring. In the next season, summer, it expands more and gets greener. In autumn, the leaves start to change color and contract; then begin to fall to the ground. This is the season where integration begins. And then in winter, the earth deepens her integration process and goes into rest and reflection. The final season, winter, is a period of bareness of the tree as it rests and reflects for the next full rhythm and cycle of growth in the spring. The death of the leaves becomes the fuel for the birth of a new season for the oak tree in the spring.  </p>\n<p>We are like oak trees. Our bodies and minds can expand, contract, and integrate just like a mighty oak - when given the right conditions and supports. When we begin to remember our True Nature, we can begin to embrace our inner nature. And from there we become more integrated and interconnected with our inner life force and the life all around us. Connecting with sun, water, and those around us to sustain our existence and full expression in the world. <em>Humans are not so different than trees.</em></p>\n<p>Oak trees and trees in general go into continuous cycles or rhythms, over and over again. That is what an expansion, contraction, and integration cycle is about. A cycle is part of a bigger pattern, a rhythm. Trees do not seek to complete one cycle but many. Humans who are healing can learn a lot from trees. For to change our Trauma Responses (unconscious body-based patterns called <em>implicit memories</em>) we can carefully and safely interrupt patterns.</p>\n<p>Say what? Yes, I know. We don’t hear about this a lot. And because there is so very little somatic trauma-trained information out there. I have provided a practice of embodied pattern interruption - required to heal trauma and shift Trauma Responses into Healing Responses…at the end of this piece.</p>\n<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/%24s_!71xg!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\">\n<picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!71xg!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!71xg!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!71xg!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!71xg!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/%24s_!71xg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png\" width=\"1024\" height=\"608\" data-attrs='{\"src\":\"https://substack-post-media.s3.amazonaws.com/public/images/c05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png\",\"srcNoWatermark\":null,\"fullscreen\":null,\"imageSize\":\"normal\",\"height\":608,\"width\":1024,\"resizeWidth\":null,\"bytes\":null,\"alt\":null,\"title\":null,\"type\":null,\"href\":null,\"belowTheFold\":false,\"topImage\":true,\"internalRedirect\":null,\"isProcessing\":false,\"align\":null,\"offset\":false}' class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!71xg!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!71xg!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!71xg!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!71xg!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png 1456w\" sizes=\"100vw\" fetchpriority=\"high\"></source></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\">\n<button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" width=\"20\" height=\"20\" viewbox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title>\n<path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewbox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button>\n</div></div>\n</div></a><figcaption class=\"image-caption\">Just like an oak tree, we expand, contract, and integrate</figcaption></figure></div>\n<p><strong>Reclaiming Regulation Rhythms: The Invisible Science of Human Interconnection</strong></p>\n<p>Trauma and stress cause us to chronically and unconsciously disconnect from our internal rhythms of being. Our sleep, our levels of human and spiritual connection, our health, our relationships, and our day-to-day experience of life is all about rhythms. </p>\n<p>And we also carry healing wisdom in our bodies when we start to get curious how our bodies and rhythms can once again mirror nature. Just like the roots of trees “talk” to one another through complex root systems. So do human nervous systems. “Trauma Brain” will often cause us to to unconsciously be hyper-independent, super avoidant, or crave human connection while also fearing the vulnerability that may come with.</p>\n<p>Complex Trauma causes the push-pull Trauma Response of desperately wanting to connect and fearing it at the same time. Which makes sense as Complex Trauma is rooted in thousands of relational ruptures that were not consistently repaired. So of course our nervous system, beliefs, and patterns had to creativity shapeshift to survive.</p>\n<p>We share so many similarities with trees. Harming a tree’s roots weakens it significantly, reducing its ability to absorb water and nutrients, leading to branches dying, wilting, leafs scorching, and eventual decline, making it suffer, which endangers nearby or plants. It is wild how we are so alike. </p>\n<p>Humans have the added component of having a social engagement system with mirror neurons. As well as personalities and stories. So when our roots are harmed like in childhood trauma, relational trauma, or systems trauma (racism, ableism, medical trauma, religious/spiritual trauma, educational/workplace trauma, betrayal trauma, political targeting, etc.) - of course our stories of ourselves, the world, and others shift to protection over connection. </p>\n<p>This is why mind-set shifts are not enough. The mind is not the “root” - the body stores the root cause…and the solution. Slowly and safely (and often with practice and support) is how we begin returning our innate regulating rhythms. And the wildest part is that our body WANTS to come into more regulation and heal trauma. And our spirit craves authenticity. Our limiting beliefs and trauma is what is holding us back. And this is exactly what somatic practices can begin to address.</p>\n<p><strong>Somatic Sovereignty: Deconstructing Your Healing from the Domination Model</strong></p>\n<p>One of my favorite definitions of trauma is that Trauma is the chronic disruption of our internal rhythms. While it is my favorite it is not popular because most of the wellness world is built on the premise of domination and controlling the body. Domination and control is actually the opposite of coming into our innate internal rhythms.  So I get why trying to heal trauma and being on social media right now is so hard. </p>\n<p>Another difficult piece of the healing puzzle is that when you do engage with trauma healing information online most wellness influences aren’t actually trained it resolving trauma and only talk about expansion or contraction. So they do not understand the most important piece of the puzzle: integration. And they villianize contraction as if it isn’t the most natural thing in the world for a body to do when in a healing rhythm.  </p>\n<p>Right now, rest and regulation is sold and commercialized in a way to dominate and control the body. And I applaud the handful of trained somatic trauma practitioners that are cutting through the nonsense and noise and teaching true somatic healing. Our bodies are part of nature itself and are not to be dominated and extracted or controlled. They are to be listened to and allowed to go through natural expansion, contraction, and integration cycles.</p>\n<p>Healing can be hard in the west because of eons of imperialism and dominating “the other.” Sadly, due to generation after generation of religiosity of denying the body - the body itself has been “othered.” And if you live the western world, we are conditioned to dissociate our bodies from nature. Most people think food comes from the store (not the land), do not get outside for hours a day (which our bodies naturally crave), and we are more isolated than we ever have been (and the human species is tribal/interconnected at our core.)</p>\n<p>You might get laughed out of the office if you told your co-worker that our bodies are like trees. Because most of western world falsely believes we are “smarter” and “more intelligent” than trees. Rarely do folks remember that we get oxygen to breathe from trees and quite literally depend on them to live life. And this is where things get really messy for a lot of folks in their healing into wholeness process. Because to heal in an insane world, you may sound “out there” to those who have not gotten curious about their suffering. </p>\n<p>So I get why healing in the west can be very hard and confusing. We have forgotten that to be human is to be part of nature. That we are nature itself. And if we forgotten this - of course we can get temporarily tricked into thinking we are some perpetual self-improvement project to be dominated and controlled. </p>\n<p>Yet a tree doesn’t care. A tree is so intelligent that it goes through it’s own expansion, contraction, and integration cycle without any fanfare or story. <em>A tree just trees. </em>And like a tree, <em>we humans can human. </em>When the right conditions come together. When we come more into our internal rhythms and back to the true nature of our Authentic Selves. When we begin to question societal narratives that are causing suffering. When we are supported to be more of who we truly are. When we begin to metabolize trauma. And when we practice somatic practices with curiosity over self-judgment.</p>\n<p>The coolest part about trees and humans is that we both contain healing impulses within us. It is why you are even here. You are at least a bit curious. Underneath trauma and social condition is your Authentic Self - waiting for Homecoming. </p>\n<p>The whole reason that we humans are coded with Trauma Responses in the first place is to preserve our minds, bodies, and spirits. We are hardwired for preservation. And underneath that preservation is our true potential. Our bodies or soma and our nervous systems want to heal into wholeness. The GPS address however gets coded to go to the “wrong address” however with unprocessed Trauma and chronic stress.</p>\n<p>Trauma and social conditioning causes our unconscious patterns to keep happening, until they are gently interrupted within our somatic capacity. And I honestly did not understand that fully until probably my tenth year of being an integrative trauma practitioner in my last couple years of Somatic Experiencing® training.</p>\n<p><strong>The 14-Diagnosis Turnaround: Moving Beyond the “Laundry List” of Diagnoses</strong></p>\n<p>Healing trauma is a lot. Real talk: for many of us being a human right now is a lot. IYKYK. And I understand how confusing navigating trauma healing can be especially when one person online says one thing and someone else says another. Then we have to add in the fact that when we have a trauma history or are neurodivergent our executive functioning is not well…functioning well.  </p>\n<p>So I get why wellness influencers don’t understand Trauma healing either and are teaching superficial stuff. But I want you to know that if someone is teaching only a partial truth or a misinformed truth - <em>that does not mean healing isn’t for you</em>. The fact is that a half truth is being recognized as BS by your body/mind/spirit. It’s not you, Boo.</p>\n<p>And I would probably be more laid back about trauma healing too if I did not also live it and spend decades suffering with complex trauma and the disability of 14 different physical and mental health conditions running rampant as the echos of said trauma. Our body and mind can only scream in the ways we can pay attention: symptoms. </p>\n<p>Like so many people online today, I went to probably 30 different doctors, therapists, and specialists with a laundry list of physical and mental health symptoms. I wanted answers. I got zero. So I get it. I wanted answers</p>\n<p>What I ended up with were 14 different diagnoses. A bunch of medications that my body was epigenetically “allergic” too and compounded my suffering. Complex Trauma was never even suggested. </p>\n<p>But my Authentic Self had a “HELL NO” deep with my body and a relentless case of curiosity that did not stop until I found solutions. Ultimately, I realized no one was coming to save me (a common child abuse and neglect pattern) and I saved my damn self in the end. </p>\n<p>So dear readers, please know I didn’t heal from Complex Trauma until I got real with myself. This was brutal, painful, and I swam in the deep sea of a Dark Night of the Soul. My Authentic Self guided me through it and I dug into the research, trained, trained, and trained some more. </p>\n<p>In the end, I healed differently than how we have been told to heal. I had to become the integrative practitioner I was so desperately seeking. And I did. She is now me.</p>\n<p>So as an integrative trauma practitioner, when we are talking about expansion only or seeking only expansion… that is only part of the healing recipe that is trauma metabolization, stress reduction, and wholeness. When we expand too much, too fast, and too soon - our nervous system naturally contracts. This is supposed to happen as this is how our nervous systems naturally come into integration. Again, given the right conditions this can happen. </p>\n<p>This is also why when folks go to retreats, do deep and intensive healing events, or do really long bio-hacking routines that are promoted online - why you may end up more dysregulated, with more intrusive thoughts, more anxious and more depressed, and with increased health symptoms. I was so jazzed to train in integrative mental health and then SO VERY disappointed to find out most of the integrative providers out there are not trauma-trained. So please remember, that too much, too fast, and too soon can RE-traumatize you. (And so can too little, not at all, or not enough.) Again, this is why trained trauma professional support that somatic is so very helpful.</p>\n<p>Overall most of the time, with unprocessed trauma, there is not enough education, support, and guidance for the expansion, contraction, and integration cycles to happen. And the other piece where trauma healing may not be working is that there is no education on any of this - hence why I am here teaching. </p>\n<p>And I know I am getting in the weeds here a bit - so what I want you to know: I<em>t is not your fault.</em> What you can and are doing right now do right now is getting curious and learning. And you are in the right place. Like I said before I lived it. And I also trained in all the things: counseling, integrative medicine, trauma, business, coaching, shamanism, you name it… and noticed  all of the gaps where people fall through and suffer even after seeking support. So I am integrating all of the myriad of things I have specialized and trained in to teach you over time, here.</p>\n<p><strong>Trauma-Training Decoded for You</strong></p>\n<p>Over and over again I will say the same thing: working with a skilled trained somatic trauma practitioner is life-changing. And I also know that not everyone can access trauma practitioners, hence why I write here.</p>\n<p>To note: there are three levels of trauma training and most people (including many practitioners themselves) have no idea what each actually are. </p>\n<ul>\n<li><p><strong>Level one is being “Trauma-Aware”: </strong>this is someone who knows trauma is a thing. They can’t treat trauma but they know it exists. Some healthcare practitioners fall into this category and some coaches. Many folks who signal that they are “Trauma-Informed” are actually “Trauma Aware.” Why? They are aware of their Trauma. That does not mean they are aware of all Trauma. And it definitely does not mean they can treat Trauma. Finally, it does mean they have started their Trauma education journey and this is to be celebrated - because you have to start somewhere and there are some universal trauma patterns that they can education on.</p></li>\n<li><p><strong>Level two is “Trauma-Informed”: </strong>this person or practitioner may have a bit of training on trauma, can name the four main trauma-responses (Fight, Flight, Freeze, and Fawn), and may have some tips and tricks in their tool-belts. Most counselors fall into this category. Some influencers can fall into this category. This category can admittedly get very confusing. Most of the world only knows of this category so right now trauma-aware, trauma-informed, and trauma-trained practitioners are showing up online or on their websites as “Trauma-Informed.” So please ask someone questions if they are signaling they are trauma-informed. They may only be trauma-aware or they could actually be trauma-trained and help you heal trauma. A lot of things fall into this category including having some training on trauma.</p></li>\n<li>\n<p><strong>Level three is “Trauma-Trained”:</strong> this person or practitioner is trained to help folks heal trauma in at least one modality. This is the rarest type of trauma specialist right now. Most trauma practitioners are trained in one main trauma modality. However, most trauma practitioners are not trained to help folks heal from complex Trauma. Being Trauma-Trained in complex Trauma requires being trained in multiple trauma healing modalities and relational strategies like attachment. Personally, I recommend that someone is also trained in neurodiversity if they claim to be Trauma-Trained. I fall into this category as I have trained in multiple trauma modalities, neurodiversity, have personal experience, and decades of professional experience. </p>\n<p></p>\n<p><em>For example, because of my ultra-trained pattern mapping abilities and decades of working with clients and knowing own patterns - I track patterns that are often unconscious in most seekers, healers, and leaders. What I track in my sessions; is how folks can safely expand without doing too much, too fast, and too soon. So they don’t re-traumatize and dysregulate themselves further. In a couple months folks often remark that they metabolized more trauma and stress in a few weeks or months than they have in decades of talk therapy. And this how bad-ass our bodies are, when the conditions for change are supported by trauma-trained professionals. While I am trauma-trained, I often write online to the general public that I am “Trauma-Informed” - because most don’t understand what Trauma-Trained means…yet. </em></p>\n</li>\n</ul>\n<p><strong>The Healthcare System is Broken, Not You</strong></p>\n<p>A broken healthcare system can make you feel like you are broken. You are not broken. Only 17% of healthcare practitioners are even trained in knowing about trauma (trauma-aware and trauma-informed), much less in helping you heal trauma (trauma-trained.) So it isn’t you.</p>\n<p>Due to unprocessed trauma, your internal GPS is simply misfiring and going to the wrong location. That is what Trauma responses do. Trauma causes us to stay in survival mode unconsciously no matter what. And when something neutral or even good happens in our lives, it is mistakenly coded as a “threat.”</p>\n<p>Why? Because neutral and goodness is not loaded into the GPS system of your body-mind as a pattern. Not yet at least. And that dear readers, is why we practice so much together when working one on one together. Healing into wholeness is a practice that not only is somatic, but also relational. </p>\n<p>Neutral and good can also be tricky for those of us with complex trauma - such as childhood trauma or relational trauma. Because our nervous system remembers not to trust “good” things, because something bad is always going to follow. For those of us raised in chaos and dysfunction or living in a society that does not include your existence - of course the good stuff of life can be tricky.</p>\n<p>And then we have these influencers online telling us what to do to heal. Somatic healing is really “hot” right not and it also is a hot mess. Folks take a three-month course online and think they are trauma experts. Or they read one book. Or they heal some of their Trauma and tell you to do the same things they did. But healing trauma is nuanced, non-linear, and messy.</p>\n<p>And Complex Trauma? Good luck finding ONE thing that heals thousands and thousands of micro-traumas that often don’t come with clear memories and only emotional flashbacks, trauma-responses out of nowhere, and relationship difficulties.</p>\n<p>So please do not get it twisted: Trauma expertise takes a lifetime. You can quote me on that too. Like I said, it took me ten years of trauma training to start to truly understand trauma healing. This was after having decades of Ph.D. in my own Complex Trauma and lived experience. Which was not enough to support all the ways in which trauma can manifest. Which are endless.</p>\n<p>For the sake of your healing process, as much as you can, please do not judge yourself against whatever is happening on social media. Or against another person healing. Or even me. I will never be trained enough. No one working with trauma can be. We can however dedicate the rest of our lives as practitioners to staying humble, listening to those we serve, and being curious.</p>\n<p>When healing and even being a healing practitioner, it is so important be kind and compassionate to ourselves as well. Trauma and social conditioning causes us to judge ourselves. Self-judgement and the judgment of others is sneaky trauma response. This keeps us safe, because then perfectionism comes in and so does the inner critic parts. And they try to keep us safe. </p>\n<p>While of course causing a lot of suffering and trauma patterns that keep us in-authentic, stuck, and suffering. So I get why judgment parts may pop up. And it is our job in Trauma recovery, to get really curious and compassionate with ourselves.</p>\n<p> So if you feel like it is taking you “too long” to heal or that a part of you thinks you “should be healed by now” or maybe another part judged you for “not being able to expand” like someone else - this is where noticing our patterns, curiosity, and self-compassion practices can help. As well as realistic trauma healing/integration like what I am hoping to convey in my writings.</p>\n<p>After the Paywall is a beautiful Oak Tree Somatic Protocol for you to practice.</p>\n      <p>\n          <a href=\"https://theintegrativepractitioner.substack.com/p/the-science-of-sustainable-wholeness\">\n              Read more\n          </a>\n      </p>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!71xg!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/c05ad37b-fd9e-48f7-8b06-afd8ab56d378_1024x608.png","type":"image/jpeg"},"categories":[]},{"title":"The Soul Can't Be Selfied: Why Healing Trauma and Finding Wholeness Is So Uncomfortable","pubDate":"2025-12-30 06:17:22","link":"https://theintegrativepractitioner.substack.com/p/the-soul-cant-be-selfied-why-healing","guid":"https://theintegrativepractitioner.substack.com/p/the-soul-cant-be-selfied-why-healing","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"An Authenticity Guide for High-Achieving Seekers","content":"\n<p>Healing into wholeness is super uncomfortable. It will destroy illusions. We may have to grieve people who never realized their potential. We may even have to grieve timelines that we hoped would exist for ourselves that never realized. And the unspoken truth: We have to get real about our suffering and the roots of our suffering in order to heal into wholeness. This is why: <em><strong>Healing is So Uncomfortable That Most Folks Won’t Ever Do It.</strong></em></p>\n<p>Wholeness can and will change your life, health, and likely your relationship patterns. It doesn’t start out like that though. It starts out often as a mess, health crisis, mid-life crisis, existential crisis, burn-out, or deep loss of someone or something. Did I mention that it may look like a crisis? Yes, this is how our soul grabs our attention - wordlessly and often, drastically. The message unfortunately has to be loud because we were never taught how to truly listen to the wisdom of our bodies. </p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics Science Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n<p>Generations of unprocessed trauma has caused collective disconnection and dissociation. The traditional healthcare system forgot to include the body and spirit into the healing process. And many (most) spiritual lineages have bypassed the body and the reality of trauma. So I get why healing into wholeness is so confusing, hard, and misunderstood.</p>\n<p>And today many of us are healing trauma and deconditioning societal programming during the age of social media. Which is a hot mess in itself. So much content and so little soul. Ai slop and hustle culture are now the norm on social media. We are more informed than we ever have been and more confused as byproduct. And that isn’t our fault. </p>\n<p>Our bodies and spirits were not meant to consume this much information from strangers online at one time. Our minds and bodies have boundaries that are being bypassed each day by social media, hustle culture, and a meta-crisis that keeps us over-informed, hypervigalent, and apathetic. This is by design to keep us disempowered consumers.</p>\n<p>The truth is that our bodies can only process so much. Even as a somatic practitioner, my body has limits and boundaries. The difference is today that I listen to my body and put my phone down. This has resulted in a lot more regulation, more energy to be creative and alive. Oh, and I don’t get involved in drama that isn’t mine. And I absolutely don’t follow masses hypnotized into collective insanity off a cliff. Instead I have recaptured my own attention, my own life force energy, and embody my divine empowerment.</p>\n<p>And what is true for me is also true for you because we share the commonality of having a human nervous system. So me becoming more authentic and aligned by way of the truth of the wisdom of my body; isn’t a “me” thing. It is a human be-ing authentically human. Fully aligned. Fully empowered. And fully authentic.</p>\n<p>Our human nervous systems and bodies are designed to function as coherent systems that can navigate the noise. When we are able to listen to the boundaries of our body-mind and our “No”, this invites more space inside ourselves so we might begin to live more of our “Yes.” And our “Yes” being more of our True Nature: which is coherent, wise, authentic, connected, curious, aligned, and so so much more.</p>\n<p><strong>The Radical Act of Humanizing Your Suffering</strong></p>\n<p>So what do we do? Well, we need to slow it down to start and be radically compassionate to ourselves. Of course we are suffering. Suffering is the greatest commonality of being human. To be human is to suffer. Start there. That is your mantra. <em><strong>“I suffer because all humans suffer.”</strong></em></p>\n<p>Next: know that living a soul-aligned life can be hard at first. All change is hard. Our minds and bodies want to keep the status quo. Even if the status quo is suffering. That is how trauma echos through the mind and body. Cultural conditioning may say “don’t rock the boat.”</p>\n<p>It gets worse before it gets better. That is your next mantra: <em><strong>“It may get a bit worse before it gets a bit better.”</strong></em> Now, did you know that your body can start to shift by actually talking to it? Yes, that is true. And talking to it with Trauma-Informed language is what works the best. </p>\n<p>Trauma-Informed language is the opposite of the “all or nothing” language of wellness influencers online. So please don’t buy into their “This is THE way to heal” or “Try this ONE thing to start living the life of your dreams.” That doesn’t work. You would not be reading this if it did.</p>\n<p>Our bodies won’t be gaslit into change and transformation. Nor will our bodies accept BS and misinformation. At first of course, you may try and in the end what may happen is that something some influencer says online simply won’t work for you. Then trauma brain will tell you that is somehow your fault. </p>\n<p>Because often Trauma Survivors have been gaslit so much that a part of  us will start to gaslight ourselves. And this causes so much suffering and I truly am sorry that this is the social media landscape we are living in.</p>\n<p>What I am here to tell you is that you are not broken and you are not “doing it wrong.” Simply, we may need to make wellness practices more trauma-informed for ourselves. A lot of times that may mean receiving individual trauma support. We also can understand what making trauma-informed practices for ourselves can look like, and that is what I am aiming to do here now.</p>\n<p>What our body wants and needs is truth, in the form of Trauma-Informed language. Truth from a trauma-informed perspective, we can talk to ourselves in a better more trauma-informed way in which we can widen the Window of Tolerance of our nervous system a bit more each day.</p>\n<p>There are many ways to do this - numerous in fact! And in this teaching, what we can start to do is to talk to our bodies in ways in which are realistic and attainable in nervous system terms (that is trauma-informed). We can do this by talking to our bodies in language of “a little bit more…” and and a “little bit less” of what you are integrating or learning about yourSelf.</p>\n<p><em><strong>Don’t take my word for it. Try it out yourself:</strong></em></p>\n<ul>\n<li><p>Notice your feet/seat on the ground</p></li>\n<li><p>Come into noticing the room around you, 360 degrees, with softer eyes</p></li>\n<li><p>Breathe and blink</p></li>\n<li><p>Next say to yourSelf/your body: “I am whole” and notice.</p></li>\n<li><p>Likely a part of your body contracted if you are a healing Trauma.</p></li>\n<li><p>Now let’s try this trauma-informed edit: “I am becoming a little bit more whole”. Then notice. Likely less of your body contracted. </p></li>\n<li><p>Notice the difference in the change of language from “whole” to “a little bit more whole.” That shift in language is what I am talking about. It makes a big difference when we talk to ourselves in more trauma-informed ways.</p></li>\n</ul>\n<p><strong>Cutting Through the Wellness Noise: Why the “One Simple Trick” is BS</strong></p>\n<p>Our world has woken up a bit to trauma but it is not yet Trauma-Informed fully. And our world is becoming spiritual but most spiritual teachers have not deconditioned their dogmatic programming of all epochs before. So there is a lot of misinformed yet well-intentioned information out there. </p>\n<p>Another difficult part for so many healing is that healing into wholeness is very individual. There are some universal things that can happen, yet your trauma and journey is uniquely yours. And no one but you will truly understand what it is to be like you. And to make it even more complex, we can’t heal alone. We are interconnected beings meant to connect to one another and heal, together, collectively. The body is interconnected to all bodies and systems around it.</p>\n<p>To simplify it: healing is unique to you, there can be universal elements, and healing will require individual pieces and collective community. Make sense? I know it all is confusing. I have spent several decades learning just to try to simplify it to make it understandable. </p>\n<p><strong>The Tightrope Walk: Why Healing Demands a Guide (Not a Guru)</strong></p>\n<p>And then it gets more difficult. Because to heal you must interrupt patterns, usually long-lasting patterns in your personal life story, your family’s patterns, and likely your culture. </p>\n<p>The hard piece is that a traumatized nervous system comes with a bunch of trauma-responses and fragmented parts that want you to keep doing what you or your family or your culture has always done - because that is what is coded in your nervous system as “safe.”</p>\n<p>So to heal is go to a place where you have never gone. And in a trauma-informed way, please do this within the window of your capacity. Not too much, not too little, and just right. And not too early or not too late but at the right time…or you may re-traumatize yourself and have new and additional traumas.</p>\n<p>Again, the nuance needed to truly teach about trauma is one of a million reasons I am not still trying to teach you on tiny squares on Instagram. </p>\n<p>To go to the authentic place in your being and in your patterns we must walk through the shadow, through the trauma, and to the next level of your potential. This is best done somatically so your mind and body gets used to the new patterns and starts to code the new patterns as “familiar.”</p>\n<p>When healing is rushed, too fast, too much, too soon, or too late - well, we can prolong our suffering. And  to walk a tightrope across a cliff to the next stage of your human and soul development to get more authentic and aligned - is best done with a light. A guide. Doing this in the dark is not recommended. Of course it can work. Yet the suffering can increase.</p>\n<p><strong>Grounded Spirituality IS Trauma-Informed (Everything Else Usually Just Bypasses)</strong></p>\n<p>My work and teachings include the love/light and depth/shadow. For this wholeness. And the Authentic Self includes it all. The soul doesn’t care about about a cute Instagram aesthetic. It doesn’t care about a linear story that ends with a cute bow. No, the soul is here to grow and does not give a damn about what society thinks.</p>\n<p>This is why I provide somatic-spiritual trauma support. Because to level up the nervous system and spirit; is like a trust fall into the Universe. Because we have never known what living authentically is like! Trauma and social conditioning cause us to live automatically and unconsciously.</p>\n<p>Our lives will shift greatly when we begin to interrupt the patterns that keep us in-authentic, mis-aligned, and suffering. This does not mean it is all sunshine and giggles. I love those stories and in those healing tales, most folks leave out the depth and shadow. Many folks never actually heal into wholeness and only share superficial successes. Again, the soul craves depth and full mind, body, and spiritual integration. Not vibes.</p>\n<p>Until we start the healing process and then start to learn that the healing process is very deep, it can be spiritual, our shadow is a real thing, and holy sh*t - I just wanted to be more regulated?! I didn’t schedule a Dark Night of the Soul in my google calendar! And my burnout didn’t align with my vacation days.</p>\n<p><strong>The Discomfort Zone: Why 90% of People Stop Before the Breakthrough</strong></p>\n<p>To make this even more uncomfortable and well, hard - the people around us who are spiritually and emotionally immature are going to become more and more noticeable. And just noticing their immaturity may be a mismatch in your arising authenticity. And that can be messy. And oh, so very uncomfortable. </p>\n<p>Now, authenticity for some can be the individuation process if they come from enmeshed families. So while authenticity can lead to embracing your new-found individual identity, there also needs to be a process back into inter-connection. </p>\n<p>Otherwise, you may unconsciously harm those you love if your authenticity and becoming process is too long, too disruptive, and too messy. Again, this is one of the million reason why I also provide individualized trauma support. Because navigating this process does not come with a map. There are no books on your healing process - except the book you are co-authoring with the Universe.</p>\n<p>Overall, the discomfort of becoming the authentic and aligned Whole Self is so hard and uncomfortable - that most folks will never do it. For those who have healed into wholeness, you know just how hard this all is. </p>\n<p>Personally, I survived complex trauma and my healing process required decades of work. So if anything, my personal experience gave me the felt sense knowing of just how much our hearts may need to break, to open up into our authenticity. And this isn’t cute. Or easy. Or even understood by most people. </p>\n<p>Also some folks may want to heal but will not have the potential to heal in this lifetime. Many empaths can get trapped by seeing someone’s potential - only for that potential to never be embodied in this lifetime. Empaths tend to see the field of ultimate potential. </p>\n<p>The problem with this when it comes to love and relationships is that the field of potential is only that: potential. For potential to be realized it must be fully embodied. This will require deep change and pattern shifts to happen, likely over years and decades. And you cannot do that work for someone else. </p>\n<p>For potential to be realized there needs to be capacity. And some folks do not have the capacity…yet. It may require lifetimes of inner work. This may result in empaths waiting an entire life for someone to heal, who cannot heal, and never accept the person in front of them as they are. The best piece of truth I can offer here is that you can love someone and you may not be able to live with them or build an aligned life with them. </p>\n<p>Others will choose comfort and “keeping the peace” at all costs. Even at the cost of their own health. Even at the cost of their own mind. Even the cost of living someone else’s life and not living as their True Self. </p>\n<p>The other elephant in the room that I see and many don’t notice (yet) is the fact that at this point, you are likely working through eons of unprocessed inter-generational and collective cultural trauma, on top of your childhood trauma. The patterns of protection may be programmed so deeply that they look like “just how your family is” or “that is just how things are” or even as an entire culture.</p>\n<p><strong>Hustle Culture and Over-Helping: When Collective Insanity Becomes Normalized</strong></p>\n<p>Look at the western world - so many horrible things are “normalized” that create so much suffering for so many. Yet they are allowed to happen. In many families, communities, and even workplaces - things like hustle culture and over-helping are encouraged. Due to eons of unprocessed ancestral and collective trauma - it is now some badge of honor to be “busy.” How insane is that? </p>\n<p>Working mothers are drowning and making less than their male peers in the west. It is 2025 and we there are still arguments about basic human rights. We have witnessed predator after predator be protected; while children continue to be harmed. This is what has been normalized. Yet this isn’t normal. This is a collective dissociation. <em><strong>Collective insanity is when insane things are normalized.</strong></em></p>\n<p>So yes, I get how healing into wholeness and then finding yourself spiritual awakening during the process can come with heaping amounts of discomfort. To make it even harder, healing is messy and more confusingly, it isn’t linear. We have influencers telling complex trauma survivors to “just do a cold plunge” and everything will be okay. Or you are just one $10,000 wellness retreat away from living the life of your dreams! </p>\n<p>I don’t buy it and neither do you. Or maybe you bought it for some time and are curious if there is another way. Or maybe you tried so many things and are just as confused and frustrated as when you started. Or maybe you did go on the retreat and learned something but there is more you desire. Well good, then you found yourself some nuanced information about the uncomfortable realities that is healing into wholeness right here. </p>\n<p>I understand the madness, I was once in your shoes. And that is why I continue to show up and teach on the hot mess that is the internet these days. Although, lately, I choose to teach only to those of you right here who are consenting to what I have to say - versus the wild west that is the rest of social media.</p>\n<p><strong>The Soul Can’t Be Selfied (Influencers Be Damned)</strong></p>\n<p>The soul absolutely does not give a sh*t about making the wholeness process Instagrammable. Influencers, be damned. And for anyone who has earnestly worked for their wholeness, you know that our Whole Self includes the light and the shadow.</p>\n<p>Many folks find themselves seeking spiritual solutions when the ways of this insane world insults their soul. And then we find out to our dismay that much of the spiritual community has bypassed the body and pushes you to dissociate or gaslight yourself. </p>\n<p>Spiritual cosplay is running rampant in a conditioned society that had repressed authentic expression. Look at any wellness retreat group photo in the past couple of years in the USA. Everyone is wearing the same f*cking hat. The same spiritual garb. <em><strong>“Look at me, I am spiritual - see I have the spiritual hat!” </strong></em></p>\n<p>True grounded and integrated spirituality is about being fully alive. Not about any practice or outfit you are wearing. Enlightened beings don’t announce themselves. They simply are living out their enlightenment as a human be-ing. <em><strong>Enlightened humans eat, they laugh, they cry, and they poop.</strong></em></p>\n<p>Enlightenment is for everyone. The biggest secret that most don’t know? The Authentic Self is the Enlightened Self - interconnected with every Authentic Self and SELF. And when we forget we are enlightened, we simply can remember. Over and over again. It is this simple. You don’t need to buy a hat to embody your soul. </p>\n<p><strong>You Are Not Broken: What is Broken is the System</strong></p>\n<p>Now spirituality can come with a lot of baggage in itself. Because of eons of religious and spiritual trauma. And for a complex trauma survivor or someone who is neurodivergent - wellness and spiritual solutions may be dysregulating. </p>\n<p>Or re-traumatizing. Or perhaps even worse: perpetuate the story that since the spiritual path isn’t working for you then the unconscious belief may be that “I must be broken.” And you my dear, are not broken. Our systems of society are what is broken. </p>\n<p>Collective insanity has created a collective dissociation at all levels of our society and this is rippling down into us. Sick systems gaslight us that we are a perpetual problem - to be fixed. By of course, some expert outside of us. </p>\n<p>And often we have been conditioned to believe we are the problem. So often when we reach out for heal to to be labeled and pathologized as dysfunctional. How insane is that? We live in a society that treats the human condition and our collective spiritual crisis as an individual pathology?!</p>\n<p> But you are not broken. What is broken is our collective spirit. What is broken is the USA healthcare system. What is broken is spirituality that doesn’t include the human nervous system that is traumatized. In my lived experience and in my work - the only way to wholeness is to not pathologize trauma responses or to spiritually bypass the human condition. </p>\n<p>Pathologizing trauma and spiritually bypassing the human are the two collective distortions that are causing so much harm in the healthcare and spiritual fields. And many of us have had our trauma responses labeled as “disordered”. </p>\n<p>And many of us have lived through gate-keeping of spirituality in our lifetimes. And many of us can sense even into our bones all of the spiritual and religious trauma that our ancestors survived as well.</p>\n<p><strong>You Are Your Own Guru, Boo: Embracing Spiritual Sovereignty</strong></p>\n<p>As someone who survived both complex trauma, pervasive child abuse, neglect, and a religious Christian cult; I understand how important it is for me to not be perceived as a gatekeeper or dogmatic. I am not someone who follows any one path. </p>\n<p>Also my definition of spirituality currently is “purpose and meaning”, “Divine Intelligence”, and “An Energy of Love that Interconnects Us All.” Which is why I leave your spirituality to be defined by you and you alone. Spiritual sovereignty is what I am all about. No gatekeepers, no gurus. You are your own, Guru, Boo.</p>\n<p>To speak of the spiritual, I do need to use words - to explain things beyond the logical mind. Which is ridiculous all in itself, because this is a written teaching. So please know I am not a spiritual guru or attempting to play one on the internet. I, like many of you am a fellow seeker and a short-term guide back to your own inner authority: Your Authentic Self.</p>\n<p>What I can say is that I am a life-long seeker who has has multiple direct mystical experiences. I have studied every type of religion for over four decades and for myself, embrace what I call “spiritual tapas”:  a little bit of this and a little bit of that. And this is what lines up with my direct experiences and multicultural ancestry. </p>\n<p>My ancestry is expansive and I am multicultural and embrace it all. My mystical experiences were in various different traditions - ancestral remembrances, past/parallel lives, multiple near death experiences, and a spontaneous soul retrieval, to name a few. </p>\n<p>Somatic, shamanic, and energy practices opened up my intuition beyond my logic and spiritual inner knowing started to emerge as I healed into wholeness. This is an archetypal process of the human spirit. And it is not often talked about and so this is why I am still online teaching after all these years.</p>\n<p>So if you are looking for a dogmatic teacher - she is not me. I am very open, extremely curious, and what I do know for sure: is that all paths that seekers earnestly go on, can and do lead Home. My psychopomp work of bridging souls stuck on this plane into their next stage of spiritual learning helps to confirm some of what my body ancestrally knows.</p>\n<p>My goal is simple here in my teachings, to be a light in the dark to remind you that we have a mind, body, spirit, and energy. And when our soul suffers, then our mind and body can speak in wordless whispers, through symptoms. We can learn how to listen better and use our body and energy as a guide back to embodying more of our soul.</p>\n<p>Authenticity is how I am teaching what enlightenment actually is when it is embodied. I came here to teach humanity how to heal. That was what my near death experience was about. It also was why I pervasively suffered and then remembered who I am and who we all are. All the training I took over the couple of decades were lessons on how to truly serve humanity.</p>\n<p>Thank you for being here. I am only a short-term sherpa on the path to embodying more of your enlightenment/authenticity. You are your own Guru, Boo.</p>\n<p><strong>Practice Time: Retraining Your Nervous System with Trauma-Informed Language</strong></p>\n<p>A Trauma-Informed Spiritual-Somatic Practice for this week:</p>\n<p>This week we are going to practice talking to ourSelves/bodies in a Trauma-Informed way. Why are we talking to ourselves and our bodies? Because we are re-training the voice of the Authentic Self. </p>\n<p>We are becoming the nurturing, compassionate, present, wise observer of all the trauma responses, parts, and wounded inner child(ren.) This Authentic Self voice can and be reformed from the inside out, with practice. </p>\n<p>I cannot even begin to describe how much my wounded inner child(ren) love to hear the wise leadership of the Authentic Self. At one point, all I could hear was traumatized parts and inner critics. It has been beyond words to witness my former inner critic willingly turn into an inner compassionate coach. Again, what is true for me is true for you as I have witnessed the same process unfold for thousands of clients I have worked with over the years.</p>\n<p>These practices changed my entire life, health, and authentic expression in the world and I will teach until my very last breath. Because these somatic-spiritual practices saved my life and welcomed my soul to express fully as the Authentic Self. </p>\n<p>Remember that practice from earlier in this teaching? We are just going to expand on that. That is how spiritual-somatic practices start to increase the regulation in our bodies and invite our authenticity to turn up a little bit - repetition and practice.</p>\n<p>Healing and wholeness is a practice. </p>\n<p><em><strong>Let’s Begin:</strong></em></p>\n<p>Whatever word, thought, or feeling, the idea of “authenticity” brings up in you: maybe it is being transparent, being creative, being curious, or compassionate. Start there with that word/thought/feeling. I will use the word “creative” for the sample practice below.</p>\n<ul>\n<li><p>Notice your feet/seat on the ground. </p></li>\n<li><p>Come into noticing the room around you, 360 degrees, with softer eyes.</p></li>\n<li><p>Breathe and blink.</p></li>\n<li><p>Now let’s try this trauma-informed mantra: “I am becoming a little bit more creative.” </p></li>\n<li><p>Then notice. </p></li>\n<li><p>How does your mind expand when you think/feel that mantra? Does a vision or thought pop into your head? What is the energy of that? (Yes, inner critic parts may pop up with something critical to say and that is natural. Both the Authentic Self and inner critics can be present and you can kindly say back to your inner critic: “thank you for keeping me safe, I am practicing noticing the energy of a little bit more creativity.” Then notice again what it is like to think/notice the energy of being a little bit creative. </p></li>\n<li><p>How does your body expand when you feel/sense that mantra? Which parts of the body open up a bit more? What is that like? (Yes, protective parts may contract in the body and that is natural. Both the Authentic Self and parts can be present. And you can kindly say back to that part of your body “thank you for keep me safe, I am practicing noticing what it feels like to notice what becoming a little bit more creative feels like.” Then once again notice what creativity feels like.</p></li>\n</ul>\n<p>Congrats! This is somatic-spiritual practice is starting to reshape your nervous system a little bit through two rounds of nervous system retraining!</p>\n<p>To be more fully human; follow my writings, practices, and love notes to humanity right here.</p>\n<p><em><strong>The authenticity in me, honors the authenticity arising in you,</strong></em></p>\n<p>-Shannon</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>This piece is part of a series I am writing on authenticity. If you enjoyed this article you may also like some of my Substack previous teachings and practices:</p>\n<p><a href=\"https://substack.com/home/post/p-165537603\">Ascension Invites Descending into the Body to Integrate Embodied Wisdom</a></p>\n<p><a href=\"https://substack.com/home/post/p-175510409\">Integrating Spiritual Awakening(s) are Part of Embodying our True Self</a></p>\n<p><a href=\"https://substack.com/home/post/p-180946592\">Uncomfortable Truth: Authenticity Is Your Greatest Untapped Power</a></p>\n<p><a href=\"https://substack.com/home/post/p-179039191\">Radical Authenticity: Why I Quit Performing Wellness</a></p>\n<p><a href=\"https://substack.com/home/post/p-176825287\">Authentic Service In the Age of Collective Insanity</a></p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>To learn more about my work you can visit <a href=\"https://theintegrativepractitioner.com/\">my website.</a> I teach folks how to truly become whole and authentic: mind, body, spirit, and energy in a non-pathologizing, realistic, somatic, and mystical/spiritual ways. Healing with me is fun, insightful, empowering, and realistic. I am in the process of refreshing my offerings and soon will have space to work with a couple of new online clients.</p>\n<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/%24s_!XTeT!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\">\n<picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!XTeT!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!XTeT!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!XTeT!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!XTeT!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/%24s_!XTeT!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png\" width=\"1024\" height=\"608\" data-attrs='{\"src\":\"https://substack-post-media.s3.amazonaws.com/public/images/a4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png\",\"srcNoWatermark\":null,\"fullscreen\":null,\"imageSize\":\"normal\",\"height\":608,\"width\":1024,\"resizeWidth\":null,\"bytes\":null,\"alt\":null,\"title\":null,\"type\":null,\"href\":null,\"belowTheFold\":true,\"topImage\":false,\"internalRedirect\":null,\"isProcessing\":false,\"align\":null,\"offset\":false}' class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!XTeT!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!XTeT!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!XTeT!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!XTeT!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fa4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png 1456w\" sizes=\"100vw\" loading=\"lazy\"></source></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\">\n<button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" width=\"20\" height=\"20\" viewbox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title>\n<path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewbox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button>\n</div></div>\n</div></a><figcaption class=\"image-caption\">The process to reclaim the Whole Self is uncomfortable, hard, and worth it</figcaption></figure></div>\n<p></p>\n<p></p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics Science Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!XTeT!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/a4c637e7-452a-4038-af31-46ebfaf2df56_1024x608.png","type":"image/jpeg"},"categories":[]},{"title":"Uncomfortable Truth: Authenticity is Your Greatest Untapped Power","pubDate":"2025-12-09 11:15:34","link":"https://theintegrativepractitioner.substack.com/p/uncomfortable-truth-authenticity","guid":"https://theintegrativepractitioner.substack.com/p/uncomfortable-truth-authenticity","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"Your Body is Your Compass and Why Wholeness Requires Leaving Illusion Behind","content":"\n<p>To change and show up more as our Authentic Selves is to often be uncertain, uncomfortable, and misunderstood. Personally, to listen to my “No” I had to grieve a whole lot. And by doing that I also grew. Both of these states were happening at the same time. That is okay as that is how wholeness works.</p>\n<p>The hard part about authenticity is that it often is uncomfortable…at first. Later on and looking back, it is entirely worth it. Yet, it is a journey to arrive embodied in our Authentic True Selves. We carry multitudes in our authenticity. The light and the shadow. The shadow when integrated, brings more untapped wisdom to the table of our Whole Self.</p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics Science Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n<p>Authenticity requires radical honesty with ourselves. And our body and mind may be saying “No” in the only ways that they can speak; through difficult thoughts and symptoms. This is what is often misunderstood by many healthcare practitioners that aren’t trauma-informed or spiritually inclusive. And again, if we only listen to the status quo; we will get what we have always gotten - the same.</p>\n<p><strong>Authenticity Asks Us to Be Courageous</strong></p>\n<p>My entire career has been about integrating identities to become more and more whole and authentic. All parts loved tenderly into the mosaic of the Authentic Self. All the roles I played, were simply lessons on becoming true to mySelf. </p>\n<blockquote>\n<p>I wasn’t a “business executive” - I was learning about business. </p>\n<p>I wasn’t a University professor, I was learning how to teach. </p>\n<p>I wasn’t a researcher - I was learning about how to translate data into a story. </p>\n<p>I wasn’t a “rehabilitation counselor” - I was learning how to be with people suffering.</p>\n<p>I wasn’t a “small business owner - I was learning to serve my community. </p>\n<p>I am not a “Somatic Experiencing Probationer” - I was learning about the wisdom of the body. </p>\n<p>I am not an “Energy Worker” - I was learning to translate energy to words. </p>\n<p>I am not a “Shamanic Apprentice” - I am learning to bridge the seen and unseen. </p>\n<p>I am not a “Trauma Expert” - I am learning to cause less harm when being with people. </p>\n</blockquote>\n<p>This is what I was learning in the roles I was playing and with integration, I no longer identify with the roles as if the role is all I am. I play these roles and I am all of them, none of them, and so much more. My work as The Integrative Practitioner is symbolic of the integration of all roles and identities. <em><strong>Because my only true identification is the embodied spiritual being beyond all roles and identities…This is the Authentic Self.</strong></em></p>\n<p>The western world is highly traumatized and conditioned and only allows a superficial self to be seen, rewarded and accepted. Simply we must be someone, we must be our roles, or we must be our professions in order to be accepted into society and matter.</p>\n<p>This however, is not the truth of our existence. When we emotionally and spiritually mature beyond a society that has never been allowed to be their Authentic Selves - we begin to see through this illusion. And to see through the illusion is not to abandon any role or identity we accidentally unconsciously played and were merged with for a false sense of security. </p>\n<p>No, we must integrate all roles and all identities and radically and compassionately love ourselves into becoming the most authentic versions of ourselves. <em><strong>The True Self that sees all the roles and versions of us as a process of becoming.</strong></em></p>\n<p>This my dears, requires courage. And it will break your ego into dust. You will not make superficial people happy in the process. You may not be understood at family holiday gathering. Some of your friends may have concerns. Your colleagues may avoid you like the plague. This is how disruptive the Authentic Self is to an emotionally and spiritually immature society. <em><strong>Authenticity terrifies the ego.</strong></em></p>\n<p><strong>Being Misunderstood Liberates the Authentic Self</strong></p>\n<p>My colleague and friend Ralph, who recently crossed over to what is next for their spirit, was a wise trauma therapist and meditation teacher. These are the roles they played and yet wasn’t identified with as they truly understood authenticity. And they would always say “the doors to the cage aren’t locked.”</p>\n<p>Ralph lived this teaching. This is a metaphor of the conditioned self trapped in a cage of societal constructs that causes suffering. And only the Authentic Self can free the conditioned false self. All of this was contained in that small one phrase teaching. This is how a true master teacher serves humanity.</p>\n<p>To be authentic is to not be understood by the masses who are hypnotized with the illusion of “success” or “being someone.” I’ve been lucky to work with successful people for decades. Some folks seemingly “have it all.” </p>\n<p>And it is only when you reach the mountaintop of what you think you needed to have to become successful: the next degree, the car, the relationship, the certification, the business, the money, etc…that a spiritual crisis may emerge.</p>\n<p>Because for the Authentic Soul, superficial things are not going to touch the depth of our hearts and souls. And waking up to this often is through a crisis, breakdown, or Dark Night of the Soul. </p>\n<p>Superficial folks around you will not understand why you are not happy, not fulfilled, and not okay. “But you have it all?!” they will say. Well indeed you do have it all…materially. <em><strong>Yet we can be materially fulfilled and emotionally and spiritually bankrupt.</strong></em></p>\n<p>Those career labels I told you about before? Well, I suffered burnout in half of them. Why? Because my soul and Authentic Self was not aligned and seemed to be allergic to superficial stuff. My soul could literally give a sh*t about some certification, she came here to learn. So burnout was a symbol and a metaphor. </p>\n<p>Also this is what the physical body does when we cross our unspoken needs, wants, and desires. The deepest parts of me - the WISE and TRUE aspects of mySelf were crying out to be heard. And my wise body slowed everything down into survival mode until the soul was allowed to shine through.</p>\n<p>As a complex Trauma survivor myself, I do want to be clear here that this needed to happen. There was no other way for me to listen to the wordless cries of my soul. Complex Trauma can cause our Authentic Self to nearly drown in the sea of fragmented parts that needed to do whatever we needed to do to survive, be seen, and be understood. </p>\n<p>The burnout that occurred in my body is also something that can happen universally when our traumatized parts try and silence our Authentic Self. <em><strong>So many of us trauma survivors and neurodivergent humans have to become someone at the superficial level in order to put the puzzle pieces of our soul back together. And that superficial someone may end up totally burnt out because our soul has been suppressed in the process.</strong></em></p>\n<p>So the Dark Night of Soul occurs. And this goes on for as long as needed until Authenticity is fully loaded. It can even happen multiple times if we have really stubborn parts or need to level up even after we think we went fully authentic. Because our authentic self can widen and expand beyond what our conditioned mind can even comprehend.</p>\n<p>This is where a “healing journey” may start or when you start reading spiritual books or get interested in alternative practices, the “woo” and stuff that may weird parts of you or those who know you out. I call this a “Soul Recon Mission” and it is okay. This is natural to the human spirit.</p>\n<p>And I want you to know that you cannot get your process wrong. At all. Whatever happens outwardly is the inner movement of the soul. Of course you can take some wrong turns that can absolutely cause a lot of suffering and this is why trauma-spiritual support are helpful. </p>\n<p>Yet the outward process is still symbolic and a metaphorical one. And your process is your process. It is not easy, it is often messy, and it is definitely uncomfortable. Can you absolutely go through multiple periods of burnout and Dark Nights of the Soul - Yes. Can support also be helpful - Yes. Is all of this worth it - You can only say Yes, on the other side of it all. </p>\n<p>Personally, my process to becoming an integrative practitioner was difficult and beautiful. Decades of inner work allowed me the time and space to integrate all dimensions of my being into my Whole Self. You cannot even imagine how misunderstood this process has been personally and professionally.</p>\n<p>It is wild to me when folks reach out because they are inspired or want to become like me. And I also understand it. Many perceive that life is easy when you are authentic or work authentically. No, this could not be further from the truth. </p>\n<p>To live and work authentically is to disrupt the status quo. And the status quo wants to remain the same. If threatened with authenticity, the status quo can be quite aggressive. Why? Societal conformity is riddled with unprocessed inter-generational pain, collective trauma, and conditioned beliefs that are passing off as a: culture, field, group, workplace, family, or system looking like “that’s just the way things are.” Classic denial and dissociation at the collective level. Authenticity requires honesty, truth, and embodied wisdom. The collective unconscious has not yet earned wisdom or known the wholeness that is the Authentic Self.</p>\n<p>Professionally, I have been misunderstood at all levels. Bullied, harassed, and treated like the next guru. Again thankfully to earned inner wisdom, wise ancestors that were searched for in earnest, and deep/consistent inner work, I know I am not the projections that someone casts upon me from their screen of their consciousness. </p>\n<p>To have done the inner work and met, included, transmuted, and embraced all aspects of myself is to truly know thyself. This is not a humble brag either. This is permission from me to you to discover who you truly are. Because at the deepest level, I am you and you are me. What is possible for me is possible for you too.</p>\n<p>So when I am harassed online by some healthcare practitioner who isn’t trauma-informed and doesn’t embrace the spiritual dimensions of being human - I know that is their stuff, not mine. Because to include someone’s mind, body, spirit, and energy in their hopes, dreams, and goals just makes sense to me. Yet to western traditional healthcare when I first talked about these things…let’s just say it wasn’t well received by everyone.</p>\n<p>Yet my soul knew to follow the inner wisdom of my Authentic Self. I can’t imagine how sick I would have become if I kept squashing my authenticity into a suffocating box of conformity. Being near death at the time of my decision to go fully authentic; I can tell you that it was a great choice of the soul. The risk was worth the reward. </p>\n<p>And if you think for one second the reward is “vibing high all of the time” - that too is an illusion of the idea of the Authentic Self. The reward also includes feeling every single emotion possible; and yet not getting lost or grasping onto any of them as they are me. </p>\n<p>Emotions are passing through me. I am witnessing emotion in the field of my soma and awareness. Because to be human and authentic is to be fully alive. And to be fully alive is to sense fully with the mind, body, and spirit.</p>\n<p>Who I know myself to really be is the one who witnesses all the waves in the ocean of my being. So don’t get it twisted; being authentic is not to be confused with “positive vibes only” That is a dissociated spiritually immature trope to get you to deny your body and live only in the spiritual realms where we have less power to make real 3D changes to our lives and the in the lives of others.</p>\n<p>Yet we are less powerful if we are only in the spiritual. The seat of the greatest untapped power is the body, the bridge from the spiritual to the physical. Where we bring our visions into reality. Where we are most empowered is being interconnected to all levels of our being: mind, body, spirit, and energy. This process I call “integration.”</p>\n<p><strong>You’re Earning Wisdom</strong></p>\n<p>The secret that the western world does not want us to know is how truly powerful we really are. We are not dis-empowered beings that need to look outward at emotionally immature leaders or a spiritually bankrupt society for permission to exist, belong, and matter. Yes, that is what many of the “perceived powers that be” want us to believe. And why is that? </p>\n<p>It is because if they keep us fearful of who we actually are: empowered co-creators, they can continue to attempt to control us and make us hate one another. Hate anyone who is “different” and doesn’t conform to their collective insanity. </p>\n<p>The western world attempts to function off of dominating the self and other. Yet indigenous wisdom and ancestral ways of being prove that we are interconnected and highly relational beings. Within each of us is a mind, body, spirit, and energy that picks up on these dimensions of being in others and the natural world. </p>\n<p>When when understand ourselves to be more than just a solid material self that is to be controlled and dominated; this process invites a curiosity into the deepest existential question one can ask: “Who am I? This is a natural process of maturing as an adult and coming into our Meta-cognition of being aware of being aware.</p>\n<p>In midlife, it is natural to get curious and to begin to deconstruct what we have been told we are and to begin to heal and become who we truly are. Unfortunately, due to the colonization of the mind and body by the western world; the sacred transition in midlife to become authentic is often disrupted, misunderstood, and because most of society is highly traumatized…the transition into midlife can be a messy crisis. This is another spiritual awakening point however, if you turn inward (and possibly get support.)</p>\n<p>Yet many are awakening to this sacred transformative initiation into being an emotionally and spiritually mature adult. To truly heal and awaking is to earn spiritual and emotional power. </p>\n<p>This empowerment is earned wisdom. This wisdom is who we are at our core and an ancestral urge within. These are the energies once somatically embodied, create the wise elder within.</p>\n<p><strong>The Body is Our Sacred Compass</strong></p>\n<p>When we begin to heal and awaken within, we can start to see that our Authentic Self has an inner compass. We are wise, we have morals, and inner ethics that can guide us more and more towards our authenticity.</p>\n<p>We may even evolve past the point of needing or even wanting spiritual gatekeepers to our True Authentic Selves. Because our Authentic Self is a Wise Self Leader. This inner leader doesn’t look outward to a false sense of authority - this energy within us is our soul. The soul being part The One who can detect the True Self in another.</p>\n<p>And our Authentic Self, the bridge to our soul and spirit can detect the realness of Self or the fake conditioned false self in another. I refer to this process that unfolds into realizing more and more truth as: discernment. </p>\n<p>In my own inner work and in what I teach my clients and those I mentor; we don’t need divination tools or oracle decks to discern the real and false self of another. We can use our own bodies as our sacred inner compass. Divination tools of course are fun and can be a tool - and these tools eventually will only confirm what your body knows once wholeness starts to arrive on the scene.</p>\n<p>And I cannot even begin to tell you just how much partnering with your body can help you trust yourSelf more. You can also begin to trust others in a whole different way. Along with trusting the Universe at a level of being an empowered co-creator.</p>\n<p>Healing into wholeness isn’t for the faint of heart. Because you will also see just how much many people’s words don’t reflect their actions or energy. You begin to see that many around us may be growing older and not wiser. We are living in a society that many adults are wounded children trapped in aging bodies. Many in “leadership positions” are those who perform and conform the most in an unwell society and definitely are not authentic.</p>\n<p>This is why healing, waking up, and becoming whole is often subconsciously avoided by many - because it truly can destroy many of our illusions. Yet, once those illusions are grieved - a life of magic, wonder, flow, creativity, curiosity, connection, compassion, and authenticity awaits on the other side of your inner process. </p>\n<p>Once we are whole, we aren’t waiting for anyone to save us. We become the one we have been waiting for. And once we heal past becoming who we needed - we can become who we truly are. This is the Authentic Self.</p>\n<p><em><strong>A Somatic Trauma-Informed Prompt to Embody 1% More Authenticity This Week:</strong></em></p>\n<ul>\n<li><p>Remember a day in the recent past when you felt a little more like yourself; freer, more honest, more alive. Even just a little bit more like who you are becoming.</p></li>\n<li><p>As you recall it, what sensations arise in your body right now? Maybe it isn’t your body that is remembering, but your mind - what visions or thoughts are you noticing?</p></li>\n<li><p>If it is your body remembering; Where do you feel warmth, openness, or ease? </p></li>\n<li><p>If it is your mind recalling; What words or meaning come up? </p></li>\n<li><p>What shifts in sided your body or mind when you imagine letting that version of you breathe in this moment a little more?</p></li>\n<li><p>You are invited to come back to this prompt once or twice a day in the morning and evening and practice this week. Notice what shifts. Journal about it, voice note yourself and listen to it back, tell someone you trust what you are noticing, or even reply in the comments.</p></li>\n</ul>\n<div><hr></div>\n<p>To be more fully human; follow my writings, practices, and love notes to humanity right here.</p>\n<p><em><strong>The authenticity in me, honors the authenticity arising in you,</strong></em></p>\n<p>-Shannon</p>\n<p>This piece is part of a series I am writing on authenticity. If you enjoyed this article you may also like some of my Substack previous teachings and practices:</p>\n<p><a href=\"https://substack.com/home/post/p-165537603\">Ascension Invites Descending into the Body to Integrate Embodied Wisdom</a> </p>\n<p><a href=\"https://substack.com/home/post/p-175510409\">Integrating Spiritual Awakening(s) are Part of Embodying our True Self</a></p>\n<p><a href=\"https://substack.com/home/post/p-179039191\">Radical Authenticity: Why I Quit Performing Wellness</a></p>\n<p><a href=\"https://substack.com/home/post/p-176825287\">Authentic Service In the Age of Collective Insanity</a></p>\n<p>To learn more about my work you can visit <a href=\"https://theintegrativepractitioner.com/\">my website.</a> I am in the process of refreshing my offerings and soon will have space to work with a couple of new online coaching clients. </p>\n<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/%24s_!DYF6!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\">\n<picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!DYF6!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!DYF6!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!DYF6!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!DYF6!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/%24s_!DYF6!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png\" width=\"1024\" height=\"608\" data-attrs='{\"src\":\"https://substack-post-media.s3.amazonaws.com/public/images/cac14b88-e911-43ca-babe-d041762a40ab_1024x608.png\",\"srcNoWatermark\":null,\"fullscreen\":null,\"imageSize\":\"normal\",\"height\":608,\"width\":1024,\"resizeWidth\":null,\"bytes\":null,\"alt\":null,\"title\":null,\"type\":null,\"href\":null,\"belowTheFold\":true,\"topImage\":false,\"internalRedirect\":null,\"isProcessing\":false,\"align\":null,\"offset\":false}' class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!DYF6!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!DYF6!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!DYF6!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!DYF6!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fcac14b88-e911-43ca-babe-d041762a40ab_1024x608.png 1456w\" sizes=\"100vw\" loading=\"lazy\"></source></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\">\n<button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" width=\"20\" height=\"20\" viewbox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title>\n<path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewbox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button>\n</div></div>\n</div></a><figcaption class=\"image-caption\">our body is a compass to the light of our soul</figcaption></figure></div>\n<p></p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics Science Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!DYF6!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/cac14b88-e911-43ca-babe-d041762a40ab_1024x608.png","type":"image/jpeg"},"categories":[]},{"title":"Radical Authenticity: Why I Quit Performing Wellness","pubDate":"2025-12-02 11:17:37","link":"https://theintegrativepractitioner.substack.com/p/radical-authenticity-why-i-quit-performing","guid":"https://theintegrativepractitioner.substack.com/p/radical-authenticity-why-i-quit-performing","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"On leaving toxic platforms, unmasking the Authentic Self, and the revolutionary act of listening to your body’s \"No.\"","content":"\n<p>After decades of personally processing complex Trauma and spiritual seeking: I am happy to report that I have found and embodied my Authentic Self. This homecoming came with much growth, expansion, and highlighted areas of my life and small business that were out of alignment with who I really am. </p>\n<p>My body of course was having a visceral reaction to the misalignment in the form of burnout. And this realization invited a chance to make changes. We have hundreds of choice points each day both big and small that can add up to life transformation. So of course I chose to make choice in favor of my authenticity or conforming and shrinking.</p>\n<p>And I have so much love and compassion for the prior selves that brought me to this realization. Because I couldn’t have become who I really am without all of versions of me that tried so hard and hustled. Capitalism is a sick system that requires us to obediently comply. So I did what capitalism said I needed to be in order to “be someone.” As I result, I worked until I burnt out. In multiple careers. </p>\n<p>Burnout can bring a lot of clarity though and reminds us where we may have crossed our own inner boundaries. Especially boundaries that were not yet revealed to us. Those unexpressed boundaries speak in symptoms and relationship issues. That is the thing about boundaries; many of the boundaries that would be absolutely life changing don’t come through words or thoughts but rather as embodied soul manifestations in the mind, body, and relationship fields.</p>\n<p>We also may have deeply ingrained unconscious patterns that can keep our best boundaries hidden, even to us. And that is the truest thing for those of us with a complex Trauma history: we have to cross our own boundaries to appease those in our lives harming us. </p>\n<p>Safety makes us contract and dissociate from our own needs in order to appease the other. Safety isn’t expansive. Safety is a state of contraction to preserve our precious life force energy. So our body and mind continues to pay high costs in order to survive dysfunction.</p>\n<p>So we appease and people please even unconsciously. Western society is as dysfunctional as the most dysfunctional family. And this dysfunctional broken system that we call society, then rewards us when we hustle and caretake others, even at our own demise. </p>\n<p>The toxic western world asks us to perform like “good business owners” and diligently post on social media - until a personal or collective soul crisis calls us inward to reflect. Burnout is a sacred messenger. Each cycle of burnout as neurodivergent humans and Trauma Survivors invites us to get bolder each time in terms of loving ourselves and accommodating our needs. </p>\n<p>Eventually, we wake up and reclaim our True Nature. I say this as if it happens overnight. It doesn’t! This journey of reclaiming my authenticity took decades of inner and outer work for me to write these words to you. As well as multiple burnouts. </p>\n<p>What I have learned on my own journey is nearly universal to the story of the  thousands of others I have guided in their journeys. To be our Authentic Selves; is to embody more and more of our wholeness. And the ways in which we are living and working that are out of alignment, may not fit anymore when wholeness begins to load and cross the threshold. </p>\n<p>Imagine the authenticity process like a cell phone battery. When our wholeness is more than 51% loaded, then we start to feel safer to be who we actually are, not continue to play the roles forced upon us to survive. This is okay and natural to becoming an emotionally and spiritually mature adult. It’s also quite literally what mid-life is all about.</p>\n<p><strong>Wholeness is Radically Liberating</strong></p>\n<p>One of the core wounds of many complex Trauma survivors is not feeling like we belong. Or belonging only at a superficial level of conditional love. Conditional love is a very narrow frequency and depends on how compliant, how “good”, and selfless we can be. </p>\n<p>Hello, perfectionism and performing! We also can get a false sense of belonging for how we can help others by sacrificing our own needs for others. Over-helping sadly is a common complex Trauma archetype. The Wounded Healer.</p>\n<p>However, authenticity is very different than the lies of our wounds. The limiting belief that we are only worth what we can produce, or how much we can help, or by posting on social media several times a day until our lives fall apart - are traps set by capitalism to fill the void that complex Trauma has created. And if don’t go inward, we can falsely assume that when capitalism burns us out, that we are somehow at fault.</p>\n<p>Yet trauma is not just individual, it is also collective. Trauma can force us to hold onto for dear life to any sense of belonging in order to matter. Our wounded inner children fear that to not matter or not belong is be annihilated. </p>\n<p>And capitalism and hustle culture lies to us that if we continue to deplete our life force energy and simply <strong>try harder</strong> - the next certification, posting three times a day, and market, market, market…that we will feel like we are enough. </p>\n<p><strong>Unprocessed Trauma Shows Up at Work</strong></p>\n<p>Western society and therefore many of the ways in which we are taught to be a successful business owner - naturally overrides our boundaries. To become authentic in service is to enter a Dark Night of the Soul to save yourself from a career of burnout disguised as “being a successful business owner.” </p>\n<p>Especially for the sensitive neurodivergent soul and Trauma Survivor. We pick up on everything. Every glance, every voice shift, and even the subtle energy bodies present in the room. And without boundaries we are just as enmeshed in our work as we were in our family of origin in order to survive. </p>\n<p>The individuation process is not just for your personal life, but also in your work life. Otherwise you will form your small business as a collection of Trauma Responses. To become aligned and authentic is to dive deep into your unconscious patterns in all areas of life. </p>\n<p>Even and especially the areas in which we are “successful” in the eyes of a dysfunctional culture. What you find may break your heart and free your soul.</p>\n<p>You may learn that Capitalism insults the soul. The soul knows what is really real and true. And it isn’t in the perfect curated online presence. We matter because all of life matters to Life itSELF. </p>\n<p>In my last Substack teaching, I shared how we belong simply by existing. And how to embody more of our Authentic Self is to enliven our soul in human form. Making authenticity a radical act of healing, leading to wholeness, and eventual inner liberation. (If you missed that teaching you may find it here: <a href=\"https://substack.com/home/post/p-178878514\">Authenticity After Trauma: Reclaiming Your True Self</a>)</p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics, Science, and Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n<p>In a world that so often asks us to perform, conform, and shrink ourselves to fit into boxes never made for us; authenticity is like a healing salve for the wounded parts of us who needed to people-please, shapeshift, and mask in order to stay safe to have a superficial level of belonging, conditional love, and a false sense of mattering.</p>\n<p><strong>The Cost of Masking</strong></p>\n<p>For those of us healing from trauma or living with neurodivergence, the pressure to mask our True Selves can run deep. We can burnout, end up with health conditions, and our relationships may suffer (to name a few.) Masking in itself tells us we are stressed and don’t feel safe. </p>\n<p>It could be because of old Trauma surfacing or new stress happening. In either case, the mask is a performance. Masking our authenticity is a core pattern of unprocessed Trauma and unexamined social conditioning. Sadly, this means that we can have a superficial feelings of “safety” when we mask. </p>\n<p>Yet to our soul this can feel like suffocation. Healing into wholeness calls us beyond surface level faking-it-until-we-make-it vibes. Because wholeness is a call to become our True Nature and embody more and more of our Authentic Selves. This is why healing into wholeness naturally can lead to an awakening of sorts. Reclaiming of more of our voice, more of our body, and more of our full presence.</p>\n<p><strong>Coming Home to My Authentic Self</strong></p>\n<p>This past year, I have gotten off social media except for when making more long-from creative content and sharing information about my offerings. My body was saying “No” to being forced to perform online for the appeasement of algorithms. In the process of uncovering how I truly want to teach; I returned to my inner wisdom and inner knowing. </p>\n<p>This knowing did not come suddenly; it came after many years of deep frustration of trying to cut through the noise, distraction, and division that social media algorithms run off of. The periods of burnout were the sacred wisdom that parts of myself had crossed the boundaries of my True Self. </p>\n<p>Trauma healing can be so very nuanced. As much of western society is highly traumatized and conditioned - there is a lot of terrible marketing advice out there. Had I kept following what capitalism said, I may have never uncovered what my True Self was craving. Luckily, the soul knows and in my process of being more authentic in my life and work; more creativity and aliveness arose in my nervous system and spirit.</p>\n<p><strong>Collective Dysregulation</strong></p>\n<p>The energy on social media is often gross and dysregulating. Being an energetic and somatic practitioner often what I was witnessing when on social media was a sanitized version of wellness or “healing.” It wasn’t realistic and it didn’t land in my nervous system as nourishing. It felt fake and lacking nuance. </p>\n<p>I saw how dysregulated most wellness influencers were. As well as, how they were trying to dominate and control their own bodies. So I took a break to reflect. In the end, I embodied the answer: to be real and nuanced with you here and now.</p>\n<p>Much of what is considered “content” is emotionally and spiritually immature. Our nervous systems aren’t meant for “hot takes” and “rage bait.” We are meant for true connection with ourselves, others, and Great Spirit. Not whatever is happening online these days. <em><strong>Seriously, what is even happening online?</strong></em></p>\n<p>The other area of frustration was that what I found on social media isn’t trauma-informed and doesn’t integrate the spiritual and deeper levels of being. And again, I want to be the answer to my own questions so I am providing more nuances trauma-informed AND spiritual education here. Where I can educate without character limits.</p>\n<p>So of course it did not feel authentic for me to continue to contribute to hustle culture online! Most social media platforms aren’t made for humans to be authentic! So, why would I try and make myself fit into platforms that don’t honor and celebrate our multidimensional authentic selves? </p>\n<p>Also, I didn’t go through several Dark Nights of the Soul to have to be fake, put on an act, or appease algorithms that doesn’t have my personal interests or our collective soul in mind. So I have chosen to show up to places where I can shift the culture and not continue the status quo. </p>\n<p>Because authenticity requires reciprocity. That is what our bodies need. We don’t have a nervous system designed to consume short-form content that feeds of dysregulation. We are meant to be in relationship with one another and commune together. This is the opposite of most social media platforms. </p>\n<p><strong>Wellness Being Performed</strong></p>\n<p>Simply what I was witnessing at the collective level was wellness being <strong>performed </strong>online. Rarely is wellness done well…well. And I get it, nuance isn’t profitable as the algorithms have shorted our attention spans into doom scrolling being the default. Because capitalism runs off hustling until we break so that a few folks make money and the rest of us stay in loops of trauma re-enactments. </p>\n<p>In a world where the algorithms are making our data and energy the product; I was wasting my precious life force trying to change a sick social media system. Instead, these days, I am choosing to create nuanced writings and teachings on Substack and YouTube as gifts to humanity. I hope to also bring back some small group teachings and practices as well in the near future.</p>\n<p>My social media strategy, if I have one beyond authenticity, is sharing on social media longer form teachings. Nuanced. Multi-dimensional mind, body, spirit, and energy education. And teaching as a regulated emotionally and spiritually mature adult. That is what I am about. </p>\n<p>And I am here for those who are aligned. Because we aren’t meant to make everyone happy. We are here to be fully human, alive, and embracing all aspects of our True Selves in relationship to those who are doing the same.</p>\n<p>What I know for sure in this shift is that my well ancestors are proud. Having a soul-aligned life and service to humanity that welcomes our authenticity is our True Nature. Coherence is what we are about. </p>\n<p>Since I have a choice to how I show up online, I am choosing authenticity. Not the fake post three-times-a-day until we burnout only for authentic content not to be shown since it doesn’t rage bait viewers into fear loops. So no, hard pass on whatever capitalism is offering as a marketing strategy. I am going with my souls inner knowing and ancestral wisdom, thank you very much.</p>\n<p><strong>From Should to Wants</strong></p>\n<p>My process is universal. I have had the privilege to work with thousands of others healing, dealing, and feeling. And a return to our soul, ancestral wisdom, and soma as is who we authentically are. We are creative beings that go through rhythms of creation, rest, and integration. </p>\n<p>Hustle culture is not a rhythm that leads to wholeness. It is a dysfunctional collective trauma response that results in depletion of life force energy. As multidimensional beings who crave depth, connection, and creativity - continuing to follow the masses off a cliff of dysregulated insanity naturally no longer was aligned with the best interests of my nervous system or our collective body.</p>\n<p>Forcing ourselves to show up in any area of life because that is what we “should” be doing is often either a trauma response or a conditioned unconscious pattern to attempt fit in a society that is toxic. When we heal, we start moving from doing what we need to do to survive - to beginning to start choosing what we want to do. And who we want to become. <em><strong>What many wellness accounts online misunderstand entirely is that Wholeness isn’t just being the person you needed when you were growing up; it is becoming who you actually are.</strong></em></p>\n<p><strong>Authenticity Influences</strong></p>\n<p>Our body says “No” in a multitude of ways and I love Somatic Experiencing©, energy, and ancestral wisdom practices to learn how to listen. Because if it wasn’t for the inner knowing of my body and spirit; I might still be crossing my own boundaries and continuing to post on toxic social media platforms because “that is what good small business owners should do.” And likely I would not be experiencing the pure joy that I receive when I write for myself and you. <em><strong>There is something beyond should; and it is what our authenticity requires. That something? Authentic inner knowing. And being received by those who welcome your unique soul signature in the world.</strong></em></p>\n<p>And who you actually are likely isn’t some cog in the wheel of capitalism that performs for likes. Who you actually are likely isn’t going to find a sense of belonging in following the masses off the cliff of conformity. No, who you actually are is beyond any definition, label, or identity that you can shrink into a social media bio link. </p>\n<p><strong>Neurodivergence and Agency</strong></p>\n<p>Also, good luck trying to stifle your multidimensionality if you have ADHD or have healed Trauma and embrace all your parts. We neurodivergent humans tend to be allergic and suffer when we have to pretend to be someone we are not. </p>\n<p>For those of us who have worked very hard to recovery from Trauma; Trauma Survivors tend to crave their agency, autonomy, and authenticity - because we had to work for it. These are good things because our soul is a mosaic of parts integrated into the Whole Self.</p>\n<p>So why one earth would I teach about authenticity and keep shrinking myself online to appease Meta platforms? Why would I choose to do that with my precious life? Why did I heal all of the things for decades on end to try and make some stranger online like me? Why is wellness being performed online in the first place?</p>\n<p>In the season I took off social media, my soul said <em><strong>“No more.”</strong></em> So now instead of spending hours on social media; I have more life force energy to write more for you. I have more energy to create. I have more energy to apply it to the relationships in my life that I want to grow and deepen. And I love that. This is just one of the many ways that authenticity can begin to influence not only our lives; but the lives of others. <em><strong>When we say “No” to things that insult our souls, it creates more room for a “Yes” of who and what is more aligned with who we authentically are.</strong></em></p>\n<p>Cheers, to authenticity!</p>\n<p><em><strong>An Authenticity Practice to Consider: </strong></em>I invite you to begin to live your Authentic Self out loud a little bit more.</p>\n<ul>\n<li><p>Notice how you feel on social media and ask your physical body or subtle energy body:</p></li>\n<li><p>“Does this content make my body and spirit expand or contract?”</p></li>\n<li>\n<p>Consider doing a social media cleanse to follow accounts that fit more of who you are authentically becoming</p>\n<p></p>\n</li>\n</ul>\n<p><em><strong>The authenticity in me, sees the authenticity in you,</strong></em></p>\n<p>-Shannon</p>\n<p>P.S. This writing is part of a multi-series on authenticity, so stay tuned for more.</p>\n<p>I have been working on expanding service offerings. Soon, I will open up my waitlist to serve new online coaching clients. To learn more about my services, you are invited to check out my <a href=\"https://theintegrativepractitioner.com/\">website.</a></p>\n<p></p>\n<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/%24s_!2hye!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\">\n<picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!2hye!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!2hye!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!2hye!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!2hye!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/%24s_!2hye!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png\" width=\"1024\" height=\"608\" data-attrs='{\"src\":\"https://substack-post-media.s3.amazonaws.com/public/images/9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png\",\"srcNoWatermark\":null,\"fullscreen\":null,\"imageSize\":\"normal\",\"height\":608,\"width\":1024,\"resizeWidth\":null,\"bytes\":null,\"alt\":null,\"title\":null,\"type\":null,\"href\":null,\"belowTheFold\":true,\"topImage\":false,\"internalRedirect\":null,\"isProcessing\":false,\"align\":null,\"offset\":false}' class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!2hye!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!2hye!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!2hye!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!2hye!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png 1456w\" sizes=\"100vw\" loading=\"lazy\"></source></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\">\n<button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" width=\"20\" height=\"20\" viewbox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title>\n<path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewbox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button>\n</div></div>\n</div></a><figcaption class=\"image-caption\">the authentic self is creative</figcaption></figure></div>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics, Science, and Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!2hye!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/9e2dafd3-4bc3-4f00-9229-f74c189f6a34_1024x608.png","type":"image/jpeg"},"categories":[]},{"title":"It's Small Business Saturday: And I Am Not Working Today","pubDate":"2025-11-29 11:17:35","link":"https://theintegrativepractitioner.substack.com/p/its-small-business-saturday-and-i","guid":"https://theintegrativepractitioner.substack.com/p/its-small-business-saturday-and-i","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"Instead I am giving you a gift","content":"\n<p>It’s Small Business Saturday!</p>\n<p>And to celebrate - I am not working or selling anything today!</p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics, Science, and Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n<p>Instead, I am giving out a gift.</p>\n<p>I have developed the world’s first nervous system archetype quiz - so you can discover your Inner Healer type.</p>\n<p>The first forty people to go to the quiz in my profile, will receive detailed information about their nervous system archetype.</p>\n<p>In my 13th year of small business ownership, I am taking the day off and also giving you something back for being a Substack follower.</p>\n<p>From the bottom of my heart, thank you. This work is not only my passion, my profession, and purpose - it also is how I feed my family and pay the bills.</p>\n<p>It could not be possible to be an authentic, integrative, and alternative trauma and stress practitioner without readers and clients.</p>\n<p>Thank you. Thank you. Thank you!</p>\n<p>- Shannon</p>\n<p>(this post was programmed to be posted a week ago - I truly am taking the day off. 13 years of doing all the things in a small business deserves a day off, no matter what capitalism says.)</p>\n<p>You can take the quiz here: https://nervous-system-quiz-391148693749.us-west1.run.app/</p>\n<p></p>\n<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/%24s_!iPvy!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\">\n<picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!iPvy!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 424w, https://substackcdn.com/image/fetch/$s_!iPvy!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 848w, https://substackcdn.com/image/fetch/$s_!iPvy!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 1272w, https://substackcdn.com/image/fetch/$s_!iPvy!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/%24s_!iPvy!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png\" width=\"1024\" height=\"1024\" data-attrs='{\"src\":\"https://substack-post-media.s3.amazonaws.com/public/images/bd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png\",\"srcNoWatermark\":null,\"fullscreen\":null,\"imageSize\":null,\"height\":1024,\"width\":1024,\"resizeWidth\":null,\"bytes\":1575546,\"alt\":null,\"title\":null,\"type\":\"image/png\",\"href\":null,\"belowTheFold\":true,\"topImage\":false,\"internalRedirect\":\"https://theintegrativepractitioner.substack.com/i/179558551?img=https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png\",\"isProcessing\":false,\"align\":null,\"offset\":false}' class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!iPvy!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 424w, https://substackcdn.com/image/fetch/$s_!iPvy!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 848w, https://substackcdn.com/image/fetch/$s_!iPvy!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 1272w, https://substackcdn.com/image/fetch/$s_!iPvy!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png 1456w\" sizes=\"100vw\" loading=\"lazy\"></source></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\">\n<button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" width=\"20\" height=\"20\" viewbox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title>\n<path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewbox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button>\n</div></div>\n</div></a></figure></div>\n<p></p>\n<div class=\"subscription-widget-wrap-editor\" data-attrs='{\"url\":\"https://theintegrativepractitioner.substack.com/subscribe?\",\"text\":\"Subscribe\",\"language\":\"en\"}' data-component-name=\"SubscribeWidgetToDOM\"><div class=\"subscription-widget show-subscribe\">\n<div class=\"preamble\"><p class=\"cta-caption\">Somatics, Science, and Spirit is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div>\n<div class=\"fake-input-wrapper\">\n<div class=\"fake-input\"></div>\n<div class=\"fake-button\"></div>\n</div>\n</div></div>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!iPvy!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/bd23a061-b74b-43dc-95ee-6a40e16375ff_1024x1024.png","type":"image/jpeg"},"categories":[]},{"title":"Authenticity After Trauma: Reclaiming Your True Self","pubDate":"2025-11-18 10:44:43","link":"https://theintegrativepractitioner.substack.com/p/authenticity-after-trauma-reclaiming","guid":"https://theintegrativepractitioner.substack.com/p/authenticity-after-trauma-reclaiming","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"Healing means embodying who you are and daring to live as your authentic self","content":"\n<p></p>\n<div class=\"captioned-image-container\"><figure><a class=\"image-link image2 is-viewable-img\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/%24s_!SGRj!,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png\" data-component-name=\"Image2ToDOM\"><div class=\"image2-inset\">\n<picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/$s_!SGRj!,w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!SGRj!,w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!SGRj!,w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!SGRj!,w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/%24s_!SGRj!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png\" width=\"1024\" height=\"608\" data-attrs='{\"src\":\"https://substack-post-media.s3.amazonaws.com/public/images/c9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png\",\"srcNoWatermark\":null,\"fullscreen\":null,\"imageSize\":\"normal\",\"height\":608,\"width\":1024,\"resizeWidth\":null,\"bytes\":null,\"alt\":null,\"title\":null,\"type\":null,\"href\":null,\"belowTheFold\":false,\"topImage\":true,\"internalRedirect\":null,\"isProcessing\":false,\"align\":null,\"offset\":false}' class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/$s_!SGRj!,w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 424w, https://substackcdn.com/image/fetch/$s_!SGRj!,w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 848w, https://substackcdn.com/image/fetch/$s_!SGRj!,w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 1272w, https://substackcdn.com/image/fetch/$s_!SGRj!,w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png 1456w\" sizes=\"100vw\" fetchpriority=\"high\"></source></picture><div class=\"image-link-expand\"><div class=\"pencraft pc-display-flex pc-gap-8 pc-reset\">\n<button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container restack-image\"><svg role=\"img\" width=\"20\" height=\"20\" viewbox=\"0 0 20 20\" fill=\"none\" stroke-width=\"1.5\" stroke=\"var(--color-fg-primary)\" stroke-linecap=\"round\" stroke-linejoin=\"round\" xmlns=\"http://www.w3.org/2000/svg\"><g><title></title>\n<path d=\"M2.53001 7.81595C3.49179 4.73911 6.43281 2.5 9.91173 2.5C13.1684 2.5 15.9537 4.46214 17.0852 7.23684L17.6179 8.67647M17.6179 8.67647L18.5002 4.26471M17.6179 8.67647L13.6473 6.91176M17.4995 12.1841C16.5378 15.2609 13.5967 17.5 10.1178 17.5C6.86118 17.5 4.07589 15.5379 2.94432 12.7632L2.41165 11.3235M2.41165 11.3235L1.5293 15.7353M2.41165 11.3235L6.38224 13.0882\"></path></g></svg></button><button tabindex=\"0\" type=\"button\" class=\"pencraft pc-reset pencraft icon-container view-image\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"20\" height=\"20\" viewbox=\"0 0 24 24\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2 lucide-maximize-2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" x2=\"14\" y1=\"3\" y2=\"10\"></line><line x1=\"3\" x2=\"10\" y1=\"21\" y2=\"14\"></line></svg></button>\n</div></div>\n</div></a><figcaption class=\"image-caption\">our true creative self </figcaption></figure></div>\n<p><strong>Our True Nature is Authenticity</strong></p>\n<p>Conformity is a collective trauma response - generations suppressing their True Nature to survive. Buried under social conditioning and the burdens of individual and ancestral trauma awaits our authenticity. When reaching for more of our authentic nature - it can be very uncomfortable. As so many of us recovering from trauma or living with neurodivergent wiring, we must remember that authenticity once came at a cost — sometimes even our safety. </p>\n<p>This is why if we are a Trauma Survivor who is recovering and or are neurodivergent - we must remind ourselves, over and over again, that to be human is to be our authentic selves. This is our True Nature. No matter what the illusions a society trapped in unprocessed Trauma Responses and unexamined social conditioning says.</p>\n<p>And being authentic is one of the one of the core characteristics of autism, ADHD, and of having earnestly worked for your trauma recovery. As trauma recovery is much of a recon mission to excavate our Trues Selves, a psyche/soul buried under burdens of trauma.</p>\n<p></p>\n      <p>\n          <a href=\"https://theintegrativepractitioner.substack.com/p/authenticity-after-trauma-reclaiming\">\n              Read more\n          </a>\n      </p>\n","enclosure":{"link":"https://substackcdn.com/image/fetch/$s_!SGRj!,f_auto,q_auto:good,fl_progressive:steep/https://substack-post-media.s3.amazonaws.com/public/images/c9d1824a-f96b-4d3d-ab26-0faa686e3aa6_1024x608.png","type":"image/jpeg"},"categories":[]},{"title":"How Performing Can Be a Trauma Response","pubDate":"2025-11-05 12:06:17","link":"https://theintegrativepractitioner.substack.com/p/how-performing-can-be-a-trauma-response","guid":"https://theintegrativepractitioner.substack.com/p/how-performing-can-be-a-trauma-response","author":"Shannon Myers, MS, SEP","thumbnail":"","description":"And What Trauma Survivors and Neurodivergent Humans Can Do to Take off the Mask","content":"\n<p>Why complex trauma, trauma, and neurodivergence often requires us to adopt masks and personas - and when we become safe and heal, those around us may prefer us to dissociate and live in functional freeze until we burnout.</p>\n<p>And I go into how burnout is a messenger and the two sacred strategies we can use to live a little bit more authentically, anyway.</p>\n","enclosure":{"link":"https://api.substack.com/feed/podcast/177022495/ad8322e9869416d0d84f01b5d493a830.mp3","type":"audio/mpeg"},"categories":[]}]}